[
    {
        "id": "sleep-routine",
        "title": "How to Build a Sleep Routine for Newborns",
        "tag": "Infants (0-12 Months)",
        "lead": "Establishing a sleep routine for your newborn not only helps them rest better but also gives you some much-needed predictability.",
        "image_path": "./images/How to Build a Sleep Routine for Newborns.jpeg",
        "pdf_path": "./pdfs/infants/How to Build a Sleep Routine for Newborns.pdf",
        "content_sections": [
            {
                "header": "Why a Sleep Routine Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Newborns sleep 14–17 hours a day, but in short bursts. A consistent routine helps regulate their internal clock, promotes healthy development, and reduces fussiness. For Pakistani parents, where extended family often plays a role, a routine also helps everyone sync with the baby's needs."
                    }
                ]
            },
            {
                "header": "Step-by-Step Guide to Building a Sleep Routine",
                "content": [
                    {
                        "type": "subheader",
                        "text": "1. Observe Your Baby's Natural Patterns"
                    },
                    {
                        "type": "paragraph",
                        "text": "In the first few weeks, newborns don't follow a schedule. Watch for signs of sleepiness—yawning, rubbing eyes, or fussiness. Note when your baby naturally falls asleep and wakes up. This helps you identify their \"sleep windows.\""
                    },
                    {
                        "type": "subheader",
                        "text": "2. Create a Calming Bedtime Routine"
                    },
                    {
                        "type": "paragraph",
                        "text": "A short, consistent pre-sleep ritual signals bedtime. Try:"
                    },
                    {
                        "type": "list",
                        "items": [
                            "<strong>Dim the lights:</strong> Use soft lighting to mimic evening, even in a bustling Pakistani household.",
                            "<strong>Gentle rocking or lullabies:</strong> Sing a soothing Urdu lullaby like \"Sohni Dharti\" or rock them gently.",
                            "<strong>Warm bath:</strong> A quick sponge bath with lukewarm water can relax your baby.",
                            "<strong>Swaddling:</strong> Wrap your baby snugly to mimic the womb's comfort, using breathable cotton to suit Pakistan's climate."
                        ]
                    },
                    {
                        "type": "paragraph",
                        "text": "Aim for 10–15 minutes of the same activities each night."
                    },
                    {
                        "type": "subheader",
                        "text": "3. Set a Day-Night Rhythm"
                    },
                    {
                        "type": "paragraph",
                        "text": "Help your baby distinguish day from night:"
                    },
                    {
                        "type": "list",
                        "items": [
                            "<strong>Daytime:</strong> Keep the room bright during naps and engage with them during wakeful periods.",
                            "<strong>Nighttime:</strong> Use dim lights, minimize stimulation, and keep feedings quiet."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "4. Feed on a Flexible Schedule"
                    },
                    {
                        "type": "paragraph",
                        "text": "Newborns need feeding every 2–3 hours. Cluster feeding (frequent feeds in the evening) is common and can help them sleep longer at night. If breastfeeding, ensure you're comfortable—use a pillow for support during late-night feeds."
                    },
                    {
                        "type": "subheader",
                        "text": "5. Create a Sleep-Friendly Environment"
                    },
                    {
                        "type": "list",
                        "items": [
                            "<strong>Safe sleep space:</strong> Use a firm mattress in a cot or bassinet, free of loose bedding, as per global safety guidelines.",
                            "<strong>Temperature control:</strong> Pakistan's weather varies, so keep the room at 20–22°C. Use fans or light blankets as needed.",
                            "<strong>White noise:</strong> A soft hum (like a fan or a shushing sound) can mimic womb sounds and block household noise."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "6. Be Consistent but Patient"
                    },
                    {
                        "type": "paragraph",
                        "text": "It takes weeks for a routine to stick. By 3–4 months, most babies start sleeping longer stretches (5–6 hours). Don't stress if progress is slow—every baby is different."
                    }
                ]
            },
            {
                "header": "Tips for Pakistani Parents",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "<strong>Family support:</strong> Involve grandparents or aunts in the routine, but ensure everyone follows the same steps to avoid confusion.",
                            "<strong>Cultural practices:</strong> Some families use mustard oil massages before bed, which can be soothing if done gently. Always check with a pediatrician.",
                            "<strong>Power outages:</strong> Keep a battery-powered lamp or fan handy for nighttime disruptions."
                        ]
                    }
                ]
            },
            {
                "header": "Common Challenges and Solutions",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "<strong>Night wakings:</strong> Normal for newborns. Respond quickly but keep interactions minimal to encourage self-soothing.",
                            "<strong>Overstimulation:</strong> Avoid loud TVs or bright screens, common in lively Pakistani homes.",
                            "<strong>Colic:</strong> If your baby cries excessively, consult a pediatrician to rule out medical issues."
                        ]
                    }
                ]
            },
            {
                "header": "When to Seek Help",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "If your baby consistently struggles to sleep or shows signs of distress, consult a pediatrician. In Pakistan, clinics like Aga Khan University Hospital or Shifa International offer pediatric support."
                    }
                ]
            },
            {
                "header": "Final Thoughts",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Building a sleep routine for your newborn is a marathon, not a sprint. Celebrate small wins, like a longer nap or a calmer bedtime. With consistency and love, you'll create a routine that helps your baby—and you—thrive."
                    },
                    {
                        "type": "paragraph",
                        "text": "<em>Disclaimer: Always follow safe sleep guidelines from trusted sources like the American Academy of Pediatrics or your local pediatrician.</em>"
                    }
                ]
            }
        ]
    },
    {
        "id": "bottle-feeding",
        "title": "Bottle Feeding 101: Choosing the Right Formula",
        "tag": "Infants (0-12 Months)",
        "lead": "Bottle feeding is a practical choice for many Pakistani parents, whether supplementing breastfeeding or as the main method.",
        "image_path": "./images/Bottle Feeding 101.jpeg",
        "pdf_path": "./pdfs/infants/Bottle Feeding 101.pdf",
        "content_sections": [
            {
                "header": "Why It Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Formula provides essential nutrients for growth. In Pakistan, where family opinions influence choices, understanding options helps you decide confidently."
                    }
                ]
            },
            {
                "header": "Choosing the Right Formula",
                "content": [
                    {
                        "type": "subheader",
                        "text": "1. Types of Formula"
                    },
                    {
                        "type": "list",
                        "items": [
                            "<strong>Cow's milk-based:</strong> Most common (e.g., Nestlé NAN, available at D-Mart).",
                            "<strong>Soy-based:</strong> For lactose intolerance (consult a pediatrician).",
                            "<strong>Hypoallergenic:</strong> For allergies or colic (e.g., Nutramigen)."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "2. Age-Appropriate"
                    },
                    {
                        "type": "list",
                        "items": [
                            "<strong>Stage 1 (0–6 months):</strong> For newborns.",
                            "<strong>Stage 2 (6–12 months):</strong> For older infants with solids."
                        ]
                    },
                    {
                        "type": "paragraph",
                        "text": "Check labels for age suitability."
                    },
                    {
                        "type": "subheader",
                        "text": "3. Consult a Pediatrician"
                    },
                    {
                        "type": "paragraph",
                        "text": "Discuss your baby's needs, especially if they have allergies or digestive issues."
                    }
                ]
            },
            {
                "header": "Bottle Feeding Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "<strong>Sterilize bottles:</strong> Boil or use a steam sterilizer (e.g., Pigeon, available at Baby World).",
                            "<strong>Prepare safely:</strong> Use boiled, cooled water; follow formula instructions exactly.",
                            "<strong>Feed on demand:</strong> Every 2–3 hours, 2–4 ounces per feed initially.",
                            "<strong>Hold baby upright:</strong> Reduces gas; burp every 1–2 ounces.",
                            "<strong>Check flow:</strong> Use slow-flow nipples for newborns to prevent choking."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "<strong>Family advice:</strong> Grandparents may suggest homemade formulas; stick to commercial ones for safety.",
                            "<strong>Storage:</strong> In hot climates, prepare fresh formula to avoid spoilage.",
                            "<strong>Affordability:</strong> Compare prices at local pharmacies or online (e.g., Daraz)."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "<strong>Refusal:</strong> Try different nipple shapes or warm formula slightly.",
                            "<strong>Constipation:</strong> Switch formulas if stools are hard (with doctor's advice).",
                            "<strong>Cost:</strong> Budget-friendly options like Meiji are reliable."
                        ]
                    }
                ]
            },
            {
                "header": "When to Seek Help",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "See a pediatrician for poor weight gain, vomiting, or allergic reactions."
                    }
                ]
            },
            {
                "header": "Final Thoughts",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Bottle feeding is a loving way to nourish your baby. With the right formula and care, they'll grow strong."
                    },
                    {
                        "type": "paragraph",
                        "text": "<em>Disclaimer: Consult a pediatrician for feeding concerns.</em>"
                    }
                ]
            }
        ]
    },
    {
        "id": "calm-baby",
        "title": "How to Calm a Crying Baby – Techniques That Work",
        "tag": "Infants (0-12 Months)",
        "lead": "A crying baby can be stressful for Pakistani parents, especially in busy households. These techniques will help soothe your newborn effectively.",
        "image_path": "./images/How to Calm a Crying Baby.jpeg",
        "pdf_path": "./pdfs/infants/How to Calm a Crying Baby.pdf",
        "content_sections": [
            {
                "header": "Why Babies Cry",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Crying is a baby’s way to signal hunger, discomfort, or tiredness. Understanding the cause is key to calming them."
                    }
                ]
            },
            {
                "header": "Techniques That Work",
                "content": [
                    {
                        "type": "subheader",
                        "text": "1. Check Basic Needs"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Hunger: Feed if it’s been 2–3 hours.",
                            "Diaper: Change if wet or soiled.",
                            "Temperature: Adjust clothing for Pakistan’s climate."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "2. Use the 5 S’s"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Swaddle: Wrap snugly in cotton.",
                            "Shush: Mimic womb sounds with a fan or “shhh.”",
                            "Side/stomach: Hold baby on their side (not for sleep).",
                            "Swing: Gentle rocking or jhoola motion.",
                            "Suck: Offer a pacifier or clean finger."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "3. White Noise"
                    },
                    {
                        "type": "paragraph",
                        "text": "Play soft sounds like a vacuum or heartbeat (available on YouTube)."
                    },
                    {
                        "type": "subheader",
                        "text": "4. Movement"
                    },
                    {
                        "type": "paragraph",
                        "text": "Walk, rock, or use a stroller. Gentle bouncing mimics womb motion."
                    },
                    {
                        "type": "subheader",
                        "text": "5. Skin-to-Skin"
                    },
                    {
                        "type": "paragraph",
                        "text": "Hold baby against your chest to regulate their heartbeat and temperature."
                    }
                ]
            },
            {
                "header": "Pakistani Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Family help: Let aunts or grandparents rock baby while you rest.",
                            "Cultural remedies: Avoid unproven methods like gripe water unless doctor-approved.",
                            "Lullabies: Sing “Allah Hoo” or local lullabies for comfort."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Colic: Excessive crying may need medical evaluation.",
                            "Overstimulation: Reduce noise or visitors in lively Pakistani homes.",
                            "Parental stress: Take breaks to stay calm."
                        ]
                    }
                ]
            },
            {
                "header": "When to Seek Help",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Consult a pediatrician (e.g., at Shifa International) for persistent crying or signs of illness."
                    }
                ]
            },
            {
                "header": "Final Thoughts",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Calming a crying baby takes trial and error. With patience, you’ll find what works for your little one."
                    },
                    {
                        "type": "paragraph",
                        "text": "<em>Disclaimer: Seek medical advice for prolonged crying.</em>"
                    }
                ]
            }
        ]
    },
    {
        "id": "baby-massage",
        "title": "Baby Massage: Why It’s Important & How to Do It",
        "tag": "Infants (0-12 Months)",
        "lead": "Baby massage is a cherished tradition in Pakistan, promoting bonding and health. Here’s why it matters and how to do it safely.",
        "image_path": "./images/Baby Massage.jpeg",
        "pdf_path": "./pdfs/infants/Baby Massage.pdf",
        "content_sections": [
            {
                "header": "Why It’s Important",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Massage soothes babies, aids digestion, and improves sleep. In Pakistan, it’s a cultural practice passed down through generations."
                    }
                ]
            },
            {
                "header": "Benefits",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Physical: Enhances circulation, relieves gas.",
                            "Emotional: Strengthens parent-baby bond.",
                            "Sleep: Promotes longer, calmer rest."
                        ]
                    }
                ]
            },
            {
                "header": "How to Massage",
                "content": [
                    {
                        "type": "subheader",
                        "text": "1. Prepare"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Time: Choose a calm moment, post-feeding but pre-nap.",
                            "Space: Use a warm, quiet room (20–22°C).",
                            "Oil: Use coconut or mustard oil (patch-test first; consult pediatrician)."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "2. Techniques"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Legs: Gently stroke from thigh to ankle; roll legs between palms.",
                            "Tummy: Use clockwise circles to aid digestion.",
                            "Arms: Stroke from shoulder to wrist.",
                            "Back: Glide hands from shoulders to hips.",
                            "Face: Lightly stroke forehead and cheeks."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "3. Duration"
                    },
                    {
                        "type": "paragraph",
                        "text": "5–10 minutes for newborns, increasing with age."
                    },
                    {
                        "type": "subheader",
                        "text": "4. Watch Cues"
                    },
                    {
                        "type": "paragraph",
                        "text": "Stop if baby fusses. Smile and talk to keep them engaged."
                    }
                ]
            },
            {
                "header": "Pakistani Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Family tradition: Learn from elders but avoid excessive pressure.",
                            "Climate: In winter, warm oil slightly for comfort.",
                            "Cultural oils: Mustard oil is common but confirm with a doctor."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Skin irritation: Switch oils if rashes appear.",
                            "Fussiness: Try a different time or shorter session.",
                            "Safety: Never massage a sick baby."
                        ]
                    }
                ]
            },
            {
                "header": "When to Seek Help",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Consult a pediatrician for rashes or if massage seems to cause discomfort."
                    }
                ]
            },
            {
                "header": "Final Thoughts",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Massage is a loving way to connect with your baby. Enjoy this special time together."
                    },
                    {
                        "type": "paragraph",
                        "text": "<em>Disclaimer: Consult a pediatrician before using oils or if concerns arise.</em>"
                    }
                ]
            }
        ]
    },
    {
        "id": "safe-diapering",
        "title": "Safe Diapering: Hygiene & Rash Prevention",
        "tag": "Infants (0-12 Months)",
        "lead": "Diapering is a daily task for Pakistani parents, but keeping your newborn clean and rash-free requires care. Here’s how to ensure safe diapering.",
        "image_path": "./images/Safe Diapering.jpeg",
        "pdf_path": "./pdfs/infants/Safe Diapering.pdf",
        "content_sections": [
            {
                "header": "Why It Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Proper diapering prevents infections and rashes, keeping your baby comfortable. In Pakistan’s humid climate, hygiene is crucial."
                    }
                ]
            },
            {
                "header": "Safe Diapering Tips",
                "content": [
                    {
                        "type": "subheader",
                        "text": "1. Choose the Right Diaper"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Disposable: Brands like Pampers (available at Naheed Supermarket) are convenient.",
                            "Cloth: Reusable langots are eco-friendly but need frequent washing.",
                            "Fit: Ensure snug fit to prevent leaks without being too tight."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "2. Change Frequently"
                    },
                    {
                        "type": "paragraph",
                        "text": "Change diapers every 2–3 hours or after a bowel movement. Newborns need 8–12 changes daily."
                    },
                    {
                        "type": "subheader",
                        "text": "3. Clean Thoroughly"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Wipe front to back: Prevents infections, especially for girls.",
                            "Use water: Lukewarm water and cotton balls are gentle. Avoid harsh soaps.",
                            "Pat dry: Ensure skin is dry to prevent moisture-related rashes."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "4. Apply Barrier Cream"
                    },
                    {
                        "type": "paragraph",
                        "text": "Use zinc oxide creams (e.g., Sudocrem) to protect against rashes. Apply thinly after cleaning."
                    },
                    {
                        "type": "subheader",
                        "text": "5. Air Time"
                    },
                    {
                        "type": "paragraph",
                        "text": "Let baby’s skin breathe diaper-free for 10–15 minutes daily, using a waterproof mat."
                    }
                ]
            },
            {
                "header": "Preventing Rashes",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Check fit: Too-tight diapers trap moisture.",
                            "Avoid talc: Powder can irritate lungs; skip it.",
                            "Watch for allergies: Change brands if rashes persist."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Climate: In humid cities like Karachi, change diapers more often.",
                            "Traditional practices: Avoid mustard oil on diaper area; it can irritate.",
                            "Washing cloth diapers: Use mild detergents like Surf Excel and sun-dry for natural disinfection."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Persistent rashes: Could indicate yeast or bacterial infection; see a pediatrician.",
                            "Travel: Carry a portable changing mat and wipes for outings."
                        ]
                    }
                ]
            },
            {
                "header": "When to Seek Help",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Consult a doctor (e.g., at Liaquat National Hospital) for severe rashes or signs of infection."
                    }
                ]
            },
            {
                "header": "Final Thoughts",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Safe diapering keeps your baby happy and healthy. With routine care, you’ll master it quickly."
                    },
                    {
                        "type": "paragraph",
                        "text": "<em>Disclaimer: Seek medical advice for persistent issues.</em>"
                    }
                ]
            }
        ]
    },
    {
        "id": "safe-home",
        "title": "Creating a Safe Home for Your Newborn",
        "tag": "Infants (0-12 Months)",
        "lead": "Welcoming a newborn to your Pakistani home is joyful, but safety is crucial. Here’s how to create a secure environment.",
        "image_path": "./images/Creating a Safe Home for Your Newborn.jpeg",
        "pdf_path": "./pdfs/infants/Creating a Safe Home for Your Newborn.pdf",
        "content_sections": [
            {
                "header": "Why It Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Newborns are vulnerable to accidents. A safe home prevents risks, giving peace of mind in Pakistan’s bustling households."
                    }
                ]
            },
            {
                "header": "Safety Tips",
                "content": [
                    {
                        "type": "subheader",
                        "text": "1. Safe Sleeping"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Cot: Use a firm mattress, no pillows or toys.",
                            "Position: Always place baby on their back.",
                            "Room-sharing: Keep cot near your bed for 6 months."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "2. Clean Environment"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Hygiene: Wash hands before handling baby.",
                            "Air quality: Ventilate rooms; avoid incense or heavy perfumes.",
                            "Pets: Supervise animals around baby."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "3. Prevent Falls"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Changing table: Never leave baby unattended; keep supplies within reach.",
                            "Stairs: Use gates if applicable."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "4. Kitchen Safety"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Hot items: Keep tea kettles or karahis out of reach.",
                            "Cords: Secure appliance cords to avoid pulling."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "5. Electrical Safety"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Outlets: Use covers (available at hardware stores).",
                            "Cords: Tuck away to prevent strangulation."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Educate everyone on safety rules.",
                            "Climate: Use mosquito nets in humid areas like Lahore.",
                            "Traditional items: Avoid heavy jhoolas unless stable."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Space constraints: In small homes, prioritize cot safety.",
                            "Power outages: Keep torches handy for nighttime checks.",
                            "Visitors: Politely enforce handwashing."
                        ]
                    }
                ]
            },
            {
                "header": "When to Seek Help",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Consult a pediatrician for safety concerns or if baby shows injury signs."
                    }
                ]
            },
            {
                "header": "Final Thoughts",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "A safe home lets your newborn thrive. Small changes make a big difference."
                    },
                    {
                        "type": "paragraph",
                        "text": "<em>Disclaimer: Follow global safety standards like those from the American Academy of Pediatrics.</em>"
                    }
                ]
            }
        ]
    },
    {
        "id": "postpartum-care",
        "title": "Postpartum Care: Caring for Baby & Yourself",
        "tag": "Infants (0-12 Months)",
        "lead": "The postpartum period is overwhelming for new moms in Pakistan, balancing baby care and recovery. Here’s how to care for both.",
        "image_path": "./images/Postpartum Care.jpeg",
        "pdf_path": "./pdfs/infants/Postpartum Care.pdf",
        "content_sections": [
            {
                "header": "Why It Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Postpartum care supports physical and emotional recovery while ensuring your baby thrives. In Pakistan, family support is key, but self-care is equally important."
                    }
                ]
            },
            {
                "header": "Caring for Baby",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Feeding: Breastfeed or bottle-feed on demand (8–12 times daily).",
                            "Sleep: Follow safe sleep practices (firm cot, back sleeping).",
                            "Hygiene: Bathe 2–3 times weekly with lukewarm water; clean diaper area frequently.",
                            "Bonding: Skin-to-skin contact and talking soothe baby."
                        ]
                    }
                ]
            },
            {
                "header": "Caring for Yourself",
                "content": [
                    {
                        "type": "subheader",
                        "text": "1. Physical Recovery"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Rest: Nap when baby sleeps, even if family chores beckon.",
                            "Nutrition: Eat protein-rich foods like daal, chicken, and eggs. Drink water or zeera tea.",
                            "Hygiene: Shower daily; use pads for postpartum bleeding.",
                            "Exercise: Start gentle walks after 6 weeks (consult your doctor)."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "2. Emotional Well-Being"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Baby blues: Mood swings are normal for 2 weeks. Talk to family or friends.",
                            "Postpartum depression: Persistent sadness needs professional help (e.g., Ziauddin Hospital)."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "3. Accept Help"
                    },
                    {
                        "type": "paragraph",
                        "text": "Let family cook, clean, or watch baby. In Pakistan, grandparents often step in—lean on them."
                    }
                ]
            },
            {
                "header": "Pakistani Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Cultural practices: Enjoy panjiri or gond laddoos for energy, but avoid overeating sweets.",
                            "40-day rest: Follow chilla traditions, but ensure light movement to prevent stiffness.",
                            "Community: Join local mom groups (e.g., on WhatsApp) for support."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Overwhelm: Delegate tasks to avoid burnout.",
                            "Family pressure: Politely set boundaries if advice feels intrusive.",
                            "Stitches or C-section: Follow doctor’s care instructions."
                        ]
                    }
                ]
            },
            {
                "header": "When to Seek Help",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "See a doctor for heavy bleeding, fever, or severe mood changes."
                    }
                ]
            },
            {
                "header": "Final Thoughts",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Postpartum is a time to heal and bond. Prioritize yourself to be the best mom you can be."
                    },
                    {
                        "type": "paragraph",
                        "text": "<em>Disclaimer: Consult healthcare professionals for medical concerns.</em>"
                    }
                ]
            }
        ]
    },
    {
        "id": "growth-milestones",
        "title": "Signs Your Infant is Hitting Growth Milestones",
        "tag": "Infants (0-12 Months)",
        "lead": "Watching your infant grow is exciting for Pakistani parents. Knowing milestone signs helps you track development and celebrate progress.",
        "image_path": "./images/Signs Your Infant is Hitting Growth Milestones.jpeg",
        "pdf_path": "./pdfs/infants/Signs Your Infant is Hitting Growth Milestones.pdf",
        "content_sections": [
            {
                "header": "Why It Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Milestones show your baby’s physical, cognitive, and social growth. In Pakistan, where family eagerly watches progress, understanding these helps ease worries."
                    }
                ]
            },
            {
                "header": "Key Milestones (0–12 Months)",
                "content": [
                    {
                        "type": "subheader",
                        "text": "1–3 Months"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Physical: Lifts head briefly during tummy time; tracks objects with eyes.",
                            "Social: Smiles spontaneously; coos or gurgles.",
                            "Cognitive: Recognizes parents’ voices or faces."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "4–6 Months"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Physical: Rolls over; reaches for toys; supports head well.",
                            "Social: Laughs; enjoys mirror play.",
                            "Cognitive: Explores objects with mouth; responds to name."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "7–9 Months"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Physical: Sits without support; crawls or scoots.",
                            "Social: Babbles (“mama,” “baba”); shows stranger anxiety.",
                            "Cognitive: Bangs objects; looks for hidden toys."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "10–12 Months"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Physical: Pulls to stand; may take first steps.",
                            "Social: Waves bye-bye; imitates gestures.",
                            "Cognitive: Understands simple words like “no.”"
                        ]
                    }
                ]
            },
            {
                "header": "How to Track",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Observe daily: Note new skills during play or feeding.",
                            "Use apps: Apps like BabyCenter track milestones.",
                            "Pediatric visits: Regular check-ups (e.g., at Indus Hospital) monitor growth."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Family input: Grandparents may compare to siblings; focus on your baby’s pace.",
                            "Cultural practices: Tummy time can follow oil massages for stimulation.",
                            "Nutrition: Breast milk or formula supports milestone progress."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Delayed milestones: Babies develop at different rates. Premature babies may take longer.",
                            "Overstimulation: Limit screen time to focus on natural play."
                        ]
                    }
                ]
            },
            {
                "header": "When to Seek Help",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Consult a pediatrician if your baby doesn’t smile by 3 months, sit by 9 months, or shows no interest in objects by 12 months."
                    }
                ]
            },
            {
                "header": "Final Thoughts",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Celebrate each milestone, big or small. Your love and attention fuel your baby’s growth."
                    },
                    {
                        "type": "paragraph",
                        "text": "<em>Disclaimer: Consult a pediatrician for developmental concerns.</em>"
                    }
                ]
            }
        ]
    },
    {
        "id": "vaccination",
        "title": "Vaccination Schedule for Pakistani Infants",
        "tag": "Infants (0-12 Months)",
        "lead": "Vaccinations protect Pakistani infants from serious diseases. Knowing the schedule ensures your baby stays healthy.",
        "image_path": "./images/Vaccination Schedule for Pakistani Infants.jpeg",
        "pdf_path": "./pdfs/infants/Vaccination Schedule for Pakistani Infants.pdf",
        "content_sections": [
            {
                "header": "Why It Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Vaccines prevent diseases like polio, common in Pakistan. Following the schedule builds immunity early."
                    }
                ]
            },
            {
                "header": "Pakistan’s EPI Schedule (0–12 Months)",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Based on the Expanded Programme on Immunization (EPI):"
                    },
                    {
                        "type": "list",
                        "items": [
                            "At Birth:",
                            {
                                "type": "sublist",
                                "items": [
                                    "BCG (tuberculosis)",
                                    "Oral Polio Vaccine (OPV 0)",
                                    "Hepatitis B"
                                ]
                            },
                            "6 Weeks:",
                            {
                                "type": "sublist",
                                "items": [
                                    "Pentavalent (DPT, Hep B, Hib) 1",
                                    "OPV 1",
                                    "Pneumococcal (PCV) 1",
                                    "Rotavirus 1"
                                ]
                            },
                            "10 Weeks:",
                            {
                                "type": "sublist",
                                "items": [
                                    "Pentavalent 2",
                                    "OPV 2",
                                    "PCV 2",
                                    "Rotavirus 2"
                                ]
                            },
                            "14 Weeks:",
                            {
                                "type": "sublist",
                                "items": [
                                    "Pentavalent 3",
                                    "OPV 3",
                                    "PCV 3",
                                    "Inactivated Polio Vaccine (IPV)"
                                ]
                            },
                            "9 Months:",
                            {
                                "type": "sublist",
                                "items": [
                                    "Measles 1"
                                ]
                            },
                            "12 Months:",
                            {
                                "type": "sublist",
                                "items": [
                                    "Measles 2 (often at 15 months, but check with doctor)"
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "Where to Get Vaccinated",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Free: EPI centers, government hospitals (e.g., Jinnah Hospital).",
                            "Private: Clinics like Aga Khan offer additional vaccines (e.g., chickenpox)."
                        ]
                    }
                ]
            },
            {
                "header": "Tips for Parents",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Track doses: Use the EPI card or a notebook.",
                            "Prepare baby: Feed and comfort before shots.",
                            "Side effects: Mild fever or fussiness is normal; use paracetamol if advised."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Community campaigns: Participate in polio drives.",
                            "Family concerns: Address myths (e.g., vaccines cause infertility) with facts.",
                            "Accessibility: Rural parents can visit local Basic Health Units."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Missed doses: Catch up with your pediatrician’s guidance.",
                            "Fear of pain: Distract baby with toys or singing.",
                            "Misinformation: Trust WHO or EPI sources."
                        ]
                    }
                ]
            },
            {
                "header": "When to Seek Help",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Contact a doctor for severe reactions like high fever or swelling."
                    }
                ]
            },
            {
                "header": "Final Thoughts",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Vaccinations are a gift of health. Stay on schedule for a strong start."
                    },
                    {
                        "type": "paragraph",
                        "text": "<em>Disclaimer: Follow your pediatrician’s advice for vaccinations.</em>"
                    }
                ]
            }
        ]
    },
    {
        "id": "breastfeeding",
        "title": "Breastfeeding Tips Every New Mom Should Know",
        "tag": "Infants (0-12 Months)",
        "lead": "Breastfeeding is a beautiful bonding experience but can be challenging for new moms in Pakistan. These tips will help you navigate it with confidence.",
        "image_path": "./images/Breastfeeding Tips Every New Mom Should Know.jpeg",
        "pdf_path": "./pdfs/infants/Breastfeeding Tips Every New Mom Should Know.pdf",
        "content_sections": [
            {
                "header": "Why Breastfeeding Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Breast milk provides essential nutrients and immunity. In Pakistan, where family support is strong, breastfeeding is culturally valued but needs practical know-how."
                    }
                ]
            },
            {
                "header": "Top Tips",
                "content": [
                    {
                        "type": "subheader",
                        "text": "1. Get the Right Latch"
                    },
                    {
                        "type": "paragraph",
                        "text": "A good latch prevents pain and ensures baby gets enough milk. Baby’s mouth should cover most of the areola, lips flanged out. Consult a lactation expert if it hurts."
                    },
                    {
                        "type": "subheader",
                        "text": "2. Find a Comfortable Position"
                    },
                    {
                        "type": "paragraph",
                        "text": "Try cradle, football, or side-lying holds. Use pillows for support, especially during late-night feeds."
                    },
                    {
                        "type": "subheader",
                        "text": "3. Feed on Demand"
                    },
                    {
                        "type": "paragraph",
                        "text": "Newborns feed 8–12 times daily, every 2–3 hours. Watch for cues like rooting or sucking hands."
                    },
                    {
                        "type": "subheader",
                        "text": "4. Stay Hydrated and Nourished"
                    },
                    {
                        "type": "paragraph",
                        "text": "Drink water, lassi, or Rooh Afza. Eat nutrient-rich foods like daal, saag, and almonds, common in Pakistani diets."
                    },
                    {
                        "type": "subheader",
                        "text": "5. Manage Engorgement"
                    },
                    {
                        "type": "paragraph",
                        "text": "Full breasts are normal initially. Nurse frequently or express milk to relieve pressure. Warm compresses help."
                    },
                    {
                        "type": "subheader",
                        "text": "6. Care for Nipples"
                    },
                    {
                        "type": "paragraph",
                        "text": "Use lanolin cream or breast milk to soothe soreness. Avoid soap on nipples to prevent dryness."
                    }
                ]
            },
            {
                "header": "Pakistani Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Family support: Accept help from mothers-in-law or sisters for chores, allowing you to focus on feeding.",
                            "Cultural myths: Ignore advice like “avoid spicy food”; eat a balanced diet unless baby reacts.",
                            "Privacy: Use dupattas or shawls for modesty in shared homes."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Low supply: Stress or dehydration can affect milk. Relax, hydrate, and consult a doctor if concerned.",
                            "Pain: Persistent pain needs professional help (e.g., Shifa International lactation consultants).",
                            "Work: Express milk if returning to work; store in a fridge for 4 hours or freezer for 6 months."
                        ]
                    }
                ]
            },
            {
                "header": "When to Seek Help",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "See a pediatrician or lactation consultant for weight gain issues, severe pain, or latching problems."
                    }
                ]
            },
            {
                "header": "Final Thoughts",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Breastfeeding is a journey of patience and love. With support, you’ll find your rhythm."
                    },
                    {
                        "type": "paragraph",
                        "text": "<em>Disclaimer: Consult healthcare professionals for personalized advice.</em>"
                    }
                ]
            }
        ]
    },

    {
        "id": "toddler-baby-proofing",
        "title": "Baby-Proofing Your Home for Walkers",
        "tag": "Toddlers (1-3 Years)",
        "lead": "A Guide for Safety",
        "image_path": "./images/Baby-Proofing for Toddlers.jpeg",
        "pdf_path": "./pdfs/toddlers/Baby-Proofing for Toddlers.pdf",
        "content_sections": [
            {
                "header": "Why It Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Toddlers are curious but lack danger awareness. Falls, burns, and choking are common risks. A safe home lets them explore confidently."
                    }
                ]
            },
            {
                "header": "Key Areas to Baby-Proof",
                "content": [
                    {
                        "type": "subheader",
                        "text": "1. Furniture"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Anchor heavy items (TVs, shelves) to walls with straps.",
                            "Add corner guards to sharp table edges.",
                            "Secure drawers with childproof locks to prevent climbing."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "2. Electrical Outlets"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Cover sockets with plug protectors.",
                            "Tuck cords behind furniture or use cord organizers."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "3. Kitchen"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Lock cabinets with cleaners or sharp tools.",
                            "Use stove knob covers and keep hot pots on back burners.",
                            "Keep a gate to block kitchen access when cooking."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "4. Bathroom"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Lock toilet lids to prevent drowning risks.",
                            "Store medicines and cosmetics out of reach.",
                            "Use non-slip mats to avoid falls."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "5. Stairs and Doors"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Install gates at stair tops and bottoms.",
                            "Add door pinch guards to prevent finger injuries."
                        ]
                    },
                    {
                        "type": "subheader",
                        "text": "6. Small Objects"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Keep coins, buttons, or small toys (like marbles) off the floor to avoid choking.",
                            "Check under furniture for hazards."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Home Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Ensure everyone knows safety rules, like keeping chai cups high.",
                            "Desi decor: Secure heavy brass vases or hookahs that toddlers can pull down.",
                            "Outdoor areas: Lock balcony doors and cover open drains in courtyards.",
                            "Budget hacks: Use rubber bands to lock cabinets or pool noodles for edge cushions."
                        ]
                    }
                ]
            },
            {
                "header": "Extra Safety Steps",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Teach boundaries: Say “No touch” for hot"
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "toddler-sleep-regression",
        "title": "Toddler Sleep Regression",
        "tag": "Toddlers (1-3 Years)",
        "lead": "What It Means and How to Handle It",
        "image_path": "./images/Toddler Sleep Regression.jpeg",
        "pdf_path": "./pdfs/toddlers/Toddler Sleep Regression.pdf",
        "content_sections": [
            {
                "header": "What is Sleep Regression?",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Sleep regression is a temporary period (2–6 weeks) when a toddler who slept well starts waking frequently, skipping naps, or resisting bedtime. It’s common at ages 18 months and 2 years due to:"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Developmental leaps: Brain growth, like learning new words or walking, can disrupt sleep.",
                            "Teething: Molars coming in can cause discomfort.",
                            "Changes: New sibling, daycare, or travel (like desi family weddings!) can throw them off.",
                            "Separation anxiety: They may cling more at night."
                        ]
                    }
                ]
            },
            {
                "header": "Signs of Sleep Regression",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Refusing naps or taking shorter ones.",
                            "Waking multiple times at night or very early.",
                            "Crying or fussing at bedtime.",
                            "Being overtired, cranky, or clingy during the day."
                        ]
                    }
                ]
            },
            {
                "header": "How to Handle It",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Stick to a routine: Consistent bedtime (e.g., bath, story, sleep) signals it’s time to wind down. Aim for 7–8 p.m. bedtime.",
                            "Create a sleep-friendly environment: Dark room, cool temperature (use a fan in Pakistan’s heat), and white noise (like a humming fan) help.",
                            "Comfort, don’t reward: If they wake, reassure with a pat or “You’re okay, go sleep.” Avoid picking up or feeding unless necessary.",
                            "Limit screen time: No TV or phones 1–2 hours before bed; blue light disrupts melatonin.",
                            "Watch daytime sleep: Too long naps (over 2 hours) can mess with night sleep. Wake them gently if needed.",
                            "Be patient: Don’t change routines drastically; regression passes with time."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Parenting Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Family support: Involve grandparents to take turns soothing the toddler at night, but ensure everyone follows the same routine.",
                            "Desi comfort: Use a soft shawl or familiar blanket for cuddling during bedtime to ease separation anxiety.",
                            "Cultural rituals: Recite a short dua or sing a lullaby like “Lori Dena” to create a calming bedtime ritual.",
                            "Manage heat: In Pakistan’s warm climate, dress toddlers in light cotton kurtas for sleep to prevent overheating."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "toddler-first-words",
        "title": "First Words",
        "tag": "Toddlers (1-3 Years)",
        "lead": "Encouraging Language Development in Toddlers",
        "image_path": "./images/First Words.jpeg",
        "pdf_path": "./pdfs/toddlers/First Words.pdf",
        "content_sections": [
            {
                "header": "Why Language Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Early language skills lay the foundation for reading, social skills, and emotional expression. By age 2, most toddlers say 200–300 words and start forming 2-word phrases like “More milk.”"
                    }
                ]
            },
            {
                "header": "Ways to Encourage Talking",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Talk all day: Narrate your actions: “Ammi’s cutting sabzi!” or “Let’s wear blue jooti.” Use simple, clear words.",
                            "Read together: Share Urdu or English board books with bright pictures. Point to objects and name them. Ask, “Where’s the cat?”",
                            "Sing songs: Nursery rhymes like “Twinkle Twinkle” or desi lullabies teach rhythm and words. Clap along for fun.",
                            "Repeat and expand: If they say “Dog,” say, “Yes, big brown dog!” This models new words.",
                            "Play with sounds: Make animal noises (meow, woof) or car sounds (vroom). It’s fun and builds speech muscles.",
                            "Limit screen time: Too much TV can delay language. Aim for under 1 hour daily and co-watch to talk about what’s on.",
                            "Encourage gestures: Teach signs like waving or pointing. It bridges to verbal communication."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Bilingual homes: Speaking Urdu, Punjabi, or Pashto at home is great! Kids can learn multiple languages at once. Use one language per parent if possible.",
                            "Desi storytelling: Share tales of Anarkali or Heer Ranjha in simple words to spark imagination.",
                            "Family chatter: Involve Nanu or Chachu in conversations. More voices mean more learning."
                        ]
                    }
                ]
            },
            {
                "header": "Milestones to Watch",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "12 months: Says 1–2 words (mama, dada).",
                            "18 months: 10–20 words, points to objects.",
                            "24 months: Combines 2-word phrases, like “Want juice.”",
                            "36 months: Uses simple sentences, like “I go park.”"
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "toddler-tantrums",
        "title": "Toddler Tantrums",
        "tag": "Toddlers (1-3 Years)",
        "lead": "How to Deal Gently and Stay Sane",
        "image_path": "./images/Toddler Tantrums.jpeg",
        "pdf_path": "./pdfs/toddlers/Toddler Tantrums.pdf",
        "content_sections": [
            {
                "header": "Why Tantrums Happen",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Toddlers (1–3 years) are learning big emotions but lack the words or control to express them. Common triggers include:"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Frustration (can’t get a toy to work).",
                            "Tiredness, hunger, or overstimulation.",
                            "Wanting independence (“No, I do it!”).",
                            "Testing boundaries to see what works."
                        ]
                    }
                ]
            },
            {
                "header": "Gentle Strategies to Manage Tantrums",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Stay calm: Your cool vibe helps them feel safe. Take a deep breath before reacting.",
                            "Get to their level: Kneel down, make eye contact, and use a soft voice. Say, “I see you’re upset. Let’s figure this out.”",
                            "Validate feelings: Name their emotion: “You’re mad because you want the biscuit.” This builds emotional awareness.",
                            "Distract or redirect: Offer a new activity, like “Let’s find your teddy!” or sing a silly song. Works best early in the tantrum.",
                            "Offer choices: Give control where possible: “Do you want the red cup or blue one?” It reduces power struggles.",
                            "Use physical comfort: A hug or gentle pat can soothe them. If they push away, give space but stay nearby.",
                            "Set clear limits: If they’re hitting or throwing, calmly say, “We don’t hit. Let’s use words.” Remove unsafe objects."
                        ]
                    }
                ]
            },
            {
                "header": "Preventing Tantrums",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Routine is king: Regular nap and meal times prevent meltdowns from hunger or fatigue.",
                            "Prep for transitions: Warn them before changes, like “Five minutes, then we leave the park.”",
                            "Snack stash: Keep healthy snacks (biscuits, fruit) handy for on-the-go moments.",
                            "Desi tip: A quick dua or soothing rhyme like “Allah hai mere saath” can calm both of you."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "toddler-potty-training",
        "title": "Potty Training",
        "tag": "Toddlers (1-3 Years)",
        "lead": "Signs of Readiness & Steps for Success",
        "image_path": "./images/Potty Training.jpeg",
        "pdf_path": "./pdfs/toddlers/Potty Training.pdf",
        "content_sections": [
            {
                "header": "Signs Your Toddler is Ready",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Every child is different, but most are ready between 18 months and 3 years. Look for these cues:"
                    },
                    {
                        "type": "list",
                        "items": [
                            "Physical readiness: They can stay dry for 2+ hours or wake up dry from naps.",
                            "Behavioral signs: They show interest in the bathroom, mimic others, or dislike wet diapers.",
                            "Communication skills: They can follow simple instructions like “sit here” or tell you they need to go (even if it’s after the fact).",
                            "Independence: They try pulling pants up/down or want to do things “myself!”"
                        ]
                    },
                    {
                        "type": "paragraph",
                        "text": "If your toddler hides while pooping or shows discomfort in diapers, it’s a good sign they’re aware of their body."
                    }
                ]
            },
            {
                "header": "Steps to Potty Training",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Introduce the idea: Talk about the potty casually. Read books like Potty by Leslie Patricelli or show videos with fun potty songs. Let them sit on a potty chair fully clothed to get comfy.",
                            "Get the gear: Choose a child-sized potty or a toilet seat adapter. Bright colors or cartoon designs can make it exciting. Keep a potty in the room they play in most.",
                            "Set a routine: Encourage sitting on the potty at key times—after waking, before bath, or after meals. Don’t force them; just make it part of the day.",
                            "Ditch the diaper (when ready): Try training pants or go diaper-free at home for a few days. Expect accidents—they’re normal! Use plastic mats on beds or sofas.",
                            "Celebrate wins: Clap, cheer, or give a small treat (like a sticker or a favorite snack) for success. Avoid punishing accidents; it can create fear.",
                            "Nighttime training: This comes later. Keep diapers on at night until they consistently wake up dry."
                        ]
                    }
                ]
            },
            {
                "header": "Tips for Pakistani Parents",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Involve family: Grandparents or older siblings can model potty use, but set boundaries if advice feels overwhelming.",
                            "Desi hacks: Use a small lota for cleaning instead of wipes for hygiene and familiarity.",
                            "Cultural comfort: Sing a fun Urdu rhyme like “Potty mein jao” to make the process playful.",
                            "Seasonal tips: In Pakistan’s hot weather, lightweight shalwar kameez make diaper-free days easier to manage."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "toddler-nutrition",
        "title": "Nutrition for Picky Toddlers",
        "tag": "Toddlers (1-3 Years)",
        "lead": "Getting Them to Eat Right",
        "image_path": "./images/Nutrition for Picky Toddlers.jpeg",
        "pdf_path": "./pdfs/toddlers/Nutrition for Picky Toddlers.pdf",
        "content_sections": [
            {
                "header": "Why Toddlers Get Picky",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Developing taste: Their taste buds are evolving, and they may reject strong flavors.",
                            "Control: Saying “no” to food is a way to assert independence.",
                            "Small stomachs: They need less food than you think, but frequent meals.",
                            "Neophobia: Fear of new foods peaks around age 2."
                        ]
                    }
                ]
            },
            {
                "header": "Tips to Encourage Healthy Eating",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Offer variety: Include a mix of carbs (roti, rice), proteins (daal, chicken), and veggies (carrots, peas) in small portions. Don’t force them to finish.",
                            "Make it fun: Cut rotis into shapes, arrange veggies like a smiley face, or call broccoli “tiny trees.” Toddlers love playful presentations.",
                            "Involve them: Let them “help” in the kitchen—stirring batter or picking a fruit builds interest in food.",
                            "Keep a schedule: Offer 3 meals and 2–3 snacks daily. Avoid grazing all day; it reduces appetite.",
                            "Model good habits: Eat together as a family. If they see you enjoying sabzi, they’re more likely to try it.",
                            "Limit distractions: No TV or toys at mealtime. Focus on the food.",
                            "Retry, don’t give up: It can take 10–15 tries for a toddler to accept a new food. Offer it in different ways (e.g., mashed vs. diced carrots)."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Food Ideas",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Breakfast: Khichdi with a little ghee or suji ka halwa with milk.",
                            "Lunch/Dinner: Chicken qeema with roti, daal-chawal, or veggie pulao.",
                            "Snacks: Boiled egg slices, fruit chaat, or homemade yogurt with honey.",
                            "Desi hack: Blend veggies into daal or qeema for hidden nutrition."
                        ]
                    }
                ]
            },
            {
                "header": "What to Avoid",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Too much sugar: Limit mithai or packaged juices; they kill appetite for meals.",
                            "Forcing food: It creates negative associations. Let them explore at their pace.",
                            "Overloading milk: 400–500 ml daily is enough. Too much reduces hunger."
                        ]
                    }
                ]
            },
            {
                "header": "Tips for Pakistani Parents",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Family meals: Involve the whole family in eating together to model healthy habits, common in joint family setups.",
                            "Desi flavors: Introduce mild spices like cumin or coriander in dishes to familiarize toddlers with Pakistani tastes.",
                            "Budget hacks: Use affordable staples like lentils or seasonal veggies for nutritious meals without breaking the bank.",
                            "Cultural celebrations: Offer small portions of festive foods like biryani during Eid, but balance with simple meals."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "toddler-activities",
        "title": "Best Activities to Boost Toddler Brain Growth",
        "tag": "Toddlers (1-3 Years)",
        "lead": "Activities to Nurture Young Minds",
        "image_path": "./images/Best Activities to Boost Toddler Brain Growth.jpeg",
        "pdf_path": "./pdfs/toddlers/Best Activities to Boost Toddler Brain Growth.pdf",
        "content_sections": [
            {
                "header": "Why Play Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Play builds neural connections for memory, focus, and emotional regulation. It also strengthens motor skills and curiosity, setting the stage for lifelong learning."
                    }
                ]
            },
            {
                "header": "Top Activities for Brain Growth",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Sensory Play",
                                "items": [
                                    "What: Fill a tub with rice, daal, or water (supervised). Add spoons or cups for scooping.",
                                    "Why: Stimulates touch and coordination.",
                                    "Desi twist: Use colored chawal or atta for mess-free fun."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Block Building",
                                "items": [
                                    "What: Stack blocks or plastic containers to make towers.",
                                    "Why: Teaches cause-and-effect and spatial skills.",
                                    "Tip: Count blocks aloud to sneak in numbers."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Story Time",
                                "items": [
                                    "What: Read colorful books like Chicka Chicka Boom Boom or Urdu stories like Chanda Mama. Point to pictures and ask questions.",
                                    "Why: Boosts vocabulary and imagination.",
                                    "Desi tip: Share oral stories about Nanu’s childhood for bonding."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Music and Movement",
                                "items": [
                                    "What: Dance to nursery rhymes or desi songs like “Lakdi ki Kathi.” Use pots as drums.",
                                    "Why: Enhances rhythm, coordination, and emotional expression.",
                                    "Tip: Make a playlist of Urdu lullabies for calm moments."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Puzzle Play",
                                "items": [
                                    "What: Use simple wooden puzzles or shape sorters.",
                                    "Why: Builds problem-solving and fine motor skills.",
                                    "Hack: DIY puzzles by cutting old calendar pictures into big pieces."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Pretend Play",
                                "items": [
                                    "What: Set up a “kitchen” with old utensils or a “shop” with toys.",
                                    "Why: Sparks creativity and social skills.",
                                    "Desi idea: Play “shaadi” with dupattas and toy jewelry."
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "Tips for Success",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Keep it short: Toddlers have short attention spans, so aim for 10–15 minute activities.",
                            "Rotate activities: Switch between sensory, active, and quiet play to keep them engaged.",
                            "Use household items: Old boxes or spoons work just as well as fancy toys for creativity.",
                            "Involve family: Let siblings or grandparents join in for group play, fostering social bonds."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "toddler-bonding",
        "title": "Building a Bond",
        "tag": "Toddlers (1-3 Years)",
        "lead": "Playtime That Strengthens Attachment with Toddlers",
        "image_path": "./images/Building a Bond.jpeg",
        "pdf_path": "./pdfs/toddlers/Building a Bond.pdf",
        "content_sections": [
            {
                "header": "Why Bonding Through Play Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Play helps toddlers feel safe and understood, boosting emotional security. It also teaches them social skills and self-esteem, key for their growing independence."
                    }
                ]
            },
            {
                "header": "Play Ideas to Strengthen Attachment",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Peek-a-Boo Plus",
                                "items": [
                                    "What: Hide behind a dupatta or door, then pop out with a silly face.",
                                    "Why: Builds trust (you always come back) and sparks giggles.",
                                    "Desi twist: Say “Kahan gaye?” in Urdu for extra fun."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Tickle Time",
                                "items": [
                                    "What: Gently tickle their tummy or feet, pausing to let them ask for more.",
                                    "Why: Physical touch releases bonding hormones like oxytocin.",
                                    "Tip: Follow their cues—stop if they seem overwhelmed."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Pretend Play",
                                "items": [
                                    "What: Play “chai party” with toy cups or “doctor” with a toy stethoscope.",
                                    "Why: Mimicking real life helps them process their world and feel close to you.",
                                    "Desi idea: Set up a mini “bazaar” with toy veggies."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Dance Party",
                                "items": [
                                    "What: Spin to desi songs like “Dil Dil Pakistan” or nursery rhymes.",
                                    "Why: Shared movement builds joy and connection.",
                                    "Hack: Use a shawl as a “parachute” to wave together."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Story Acting",
                                "items": [
                                    "What: Act out a story (like a lion chasing a mouse) with exaggerated voices.",
                                    "Why: Encourages imagination and emotional closeness.",
                                    "Desi tip: Use tales like “Chand ki Sair” for cultural vibes."
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "Tips for Meaningful Play",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Be present: Put away phones. Even 10 minutes of focused play matters.",
                            "Follow their lead: If they want to stack blocks instead of dance, join in.",
                            "Use eye contact: Smile and nod to show you’re engaged.",
                            "Praise effort: Say “Wow, you built a big tower!” to boost confidence."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Parenting Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint family fun: Involve grandparents or aunties in playtime to strengthen family ties.",
                            "Cultural games: Teach traditional games like “pithoo” with soft toys for safe fun.",
                            "Outdoor play: Use courtyard or rooftop spaces for safe, supervised play in fresh air.",
                            "Desi rewards: Offer a small piece of gur or a hug as a reward for joining in play."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "toddler-remedies",
        "title": "Desi Remedies vs. Doctor Advice",
        "tag": "Toddlers (1-3 Years)",
        "lead": "What to Trust for Toddlers",
        "image_path": "./images/Desi Remedies vs Doctor Advice.jpeg",
        "pdf_path": "./pdfs/toddlers/Desi Remedies vs Doctor Advice.pdf",
        "content_sections": [
            {
                "header": "Common Desi Remedies",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Haldi Milk for Colds",
                                "items": [
                                    "What: Warm milk with a pinch of turmeric.",
                                    "Verdict: Safe and soothing. Turmeric has anti-inflammatory properties, but don’t overdo it (1/4 tsp max). Check with a doctor for kids under 2."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Honey for Cough",
                                "items": [
                                    "What: A spoonful of honey at bedtime.",
                                    "Verdict: Works for kids over 1. Studies show it soothes coughs better than some syrups. NEVER give honey to babies under 12 months (botulism risk)."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Ghee on Chest for Congestion",
                                "items": [
                                    "What: Rub warm ghee on chest or soles.",
                                    "Verdict: Safe but unproven. It may feel comforting but won’t clear congestion. Use sparingly to avoid skin irritation."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Joshanda for Flu",
                                "items": [
                                    "What: Herbal tea mix for colds.",
                                    "Verdict: Okay in small amounts for kids over 2, diluted. Avoid store-bought mixes with unknown ingredients. Consult a doctor first."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Saffron for Teething",
                                "items": [
                                    "What: Rub kesar paste on gums.",
                                    "Verdict: Risky. Saffron can cause allergic reactions or toxicity in toddlers. Use chilled teething rings instead."
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "When to Trust the Doctor",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Fever over 100.4°F (38°C): Especially if it lasts over 24 hours or with lethargy. Avoid ubtan or cold sponges; use paracetamol as prescribed.",
                            "Diarrhea or Vomiting: Desi “rice water” may hydrate, but oral rehydration salts (ORS) are proven to replace lost electrolytes.",
                            "Rashes or Breathing Issues: Skip oils or totkas; these need urgent medical checks for allergies or infections.",
                            "Chronic Issues: If your toddler’s cough, poor weight gain, or fussiness persists, don’t rely on home remedies. Get tests done."
                        ]
                    }
                ]
            },
            {
                "header": "Tips for Pakistani Parents",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Balance tradition and science: Discuss desi remedies with your pediatrician to ensure safety.",
                            "Family advice: Respect Dadi’s wisdom but verify totkas with a doctor, especially for serious symptoms.",
                            "Local resources: Use trusted brands for remedies like joshanda, and check ingredients for allergens.",
                            "Hygiene first: Ensure clean water and utensils when preparing home remedies to avoid infections."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "toddler-illnesses",
        "title": "Common Illnesses in Toddlers",
        "tag": "Toddlers (1-3 Years)",
        "lead": "When to Worry",
        "image_path": "./images/Common Illnesses in Toddlers.jpeg",
        "pdf_path": "./pdfs/toddlers/Common Illnesses in Toddlers.pdf",
        "content_sections": [
            {
                "header": "Common Toddler Illnesses",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Colds",
                                "items": [
                                    "Symptoms: Runny nose, cough, mild fever, sneezing.",
                                    "Care: Rest, fluids (water, diluted juice), and a humidifier. Saline drops clear stuffy noses.",
                                    "Desi tip: Haldi milk (for kids over 1) can soothe.",
                                    "When to worry: Fever over 100.4°F (38°C) for 3+ days, trouble breathing, or ear pain."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Ear Infections",
                                "items": [
                                    "Symptoms: Ear-tugging, fussiness, fever, poor sleep.",
                                    "Care: See a doctor; antibiotics may be needed. Pain relievers (paracetamol) help.",
                                    "When to worry: Persistent fever or discharge from ear."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Diarrhea",
                                "items": [
                                    "Symptoms: Frequent loose stools, sometimes with vomiting.",
                                    "Care: Give oral rehydration salts (ORS), not just rice water. Avoid sugary drinks.",
                                    "When to worry: No urine for 6+ hours, sunken eyes, or blood in stool."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Fever",
                                "items": [
                                    "Symptoms: Temperature over 100.4°F (38°C), irritability.",
                                    "Care: Light clothing, paracetamol (per doctor’s dose), and fluids. Avoid cold sponges.",
                                    "When to worry: Fever lasts 3+ days, rash appears, or child is lethargic."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Rashes",
                                "items": [
                                    "Symptoms: Red spots, itchiness, or bumps.",
                                    "Care: Keep skin clean and dry. Avoid desi oils unless doctor-approved.",
                                    "When to worry: Rash with fever, spreading fast, or blisters."
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "Prevention Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Hygiene: Teach handwashing and keep toys clean.",
                            "Vaccines: Follow Pakistan’s EPI schedule (e.g., measles, polio) to reduce risks.",
                            "Nutrition: Offer fruits, daal, and yogurt for immunity.",
                            "Avoid crowds: Limit exposure during flu season or family gatherings."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Seasonal care: In monsoon season, keep toddlers dry to prevent colds and skin infections.",
                            "Family gatherings: Be cautious at weddings or dawats, where germs spread easily.",
                            "Desi remedies: Use safe totkas like haldi milk sparingly, but always consult a doctor for persistent symptoms.",
                            "Access to care: Know your local pediatrician’s contact and nearby clinic for emergencies."
                        ]
                    }
                ]
            }
        ]
    },

    {
        "id": "preschooler-emotional-intelligence",
        "title": "Emotional Intelligence in Little Kids",
        "tag": "Preschoolers (3-5 Years)",
        "lead": "Nurturing Feelings",
        "image_path": "./images/Emotional Intelligence in Little Kids.jpeg",
        "pdf_path": "./pdfs/preschoolers/Emotional Intelligence in Little Kids.pdf",
        "content_sections": [
            {
                "header": "What is Emotional Intelligence?",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "EQ is the ability to recognize, express, and manage emotions. For preschoolers, it means naming “I’m mad” or calming down after a fight over toys."
                    }
                ]
            },
            {
                "header": "Why It Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Kids with high EQ handle stress better, make friends easier, and grow into empathetic adults—key in our collectivist culture."
                    }
                ]
            },
            {
                "header": "Ways to Boost EQ",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Name emotions: Use simple words like “happy,” “sad,” or “angry.” Say, “You look frustrated because the puzzle is hard.”",
                            "Model feelings: Share your emotions: “Ammi’s tired, so I’m resting.” It shows feelings are normal.",
                            "Read stories: Books like The Color Monster or Urdu tales teach emotions through characters. Ask, “Why is the lion sad?”",
                            {
                                "type": "sublist",
                                "title": "Play feeling games",
                                "items": [
                                    "Make silly faces (happy, scared) and guess each other’s emotions.",
                                    "Use puppets to act out “angry” or “kind” scenarios."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Teach calming tricks",
                                "items": [
                                    "Blow “bubbles” (deep breaths) when upset.",
                                    "Count to 5 slowly to cool off.",
                                    "Desi tip: Sing a soothing rhyme like “Chanda Mama” to relax."
                                ]
                            },
                            "Validate their feelings: If they cry, say, “It’s okay to be sad. Want a hug?” Don’t dismiss with “Bas, chup karo.”",
                            "Solve conflicts: If they grab a toy, guide them: “Ask, ‘Can I play?’ instead of taking it.”"
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Parenting Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Cultural norms: Teach respect for elders’ feelings (e.g., “Dadi’s quiet, let’s give her space”).",
                            "Joint families: Use family dynamics to practice empathy: “Baji’s upset; let’s cheer her up.”",
                            "Desi gatherings: Guide kids to express gratitude, like saying “shukriya” to aunties for treats, to build emotional awareness.",
                            "Storytelling: Share simple family anecdotes about kindness to model empathy in a cultural context."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "preschooler-manners",
        "title": "How to Teach Manners at Home for Preschoolers",
        "tag": "Preschoolers (3-5 Years)",
        "lead": "Instilling Politeness and Respect",
        "image_path": "./images/How to Teach Manners at Home for Preschoolers.jpeg",
        "pdf_path": "./pdfs/preschoolers/How to Teach Manners at Home for Preschoolers.pdf",
        "content_sections": [
            {
                "header": "Why Manners Matter",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Manners help kids navigate social settings, show respect, and build confidence. They also reflect family values, key in our culture."
                    }
                ]
            },
            {
                "header": "Simple Manners to Teach",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Greetings: Practice saying “Assalamualaikum” or “Adaab” when meeting elders. Wave “Khuda hafiz” at goodbyes.",
                            "Please and Thank You: Model “Please, pass the roti” or “Shukriya for helping.” Prompt them gently: “What do we say?”",
                            "Table Etiquette: Teach eating with hands neatly (common in Pakistan) or using a spoon. Say, “Chew quietly, no talking with food.”",
                            "Respecting Elders: Encourage touching feet or a polite nod for Nanu or Dadi. Explain why it matters.",
                            "Sharing: During playdates, guide them to share toys: “Let’s take turns with the car.”",
                            "Apologizing: If they bump someone, say, “Say sorry, it was an accident.” Model it yourself."
                        ]
                    }
                ]
            },
            {
                "header": "How to Teach Them",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Lead by example: Kids mimic you. Say “shukriya” to shopkeepers or “sorry” when you err.",
                            "Make it fun: Role-play a tea party where they practice “please” and “thank you.”",
                            "Praise efforts: Cheer, “Wow, you said adaab so nicely!” instead of scolding mistakes.",
                            "Keep it age-appropriate: Expect short greetings, not perfect sentences.",
                            "Repeat gently: Remind them calmly: “Let’s try saying shukriya again.”"
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Parenting Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Cultural pride: Frame manners as part of “tehzeeb” (culture). Share stories of how elders value respect.",
                            "Joint families: Enlist Chachu or Baji to reinforce manners during family time.",
                            "Avoid shaming: Skip phrases like “Sharam nahi aati?”—they discourage kids.",
                            "Festive practice: Use Eid or weddings to practice greetings like “Eid Mubarak” with elders."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Shyness: If they’re hesitant to greet elders, practice at home with role-play until they’re comfortable.",
                            "Inconsistency: Joint family members may have different expectations; set a unified approach with grandparents.",
                            "Impatience: Preschoolers may forget manners under excitement; gently remind them without frustration.",
                            "Cultural pressure: Avoid comparing kids to others at dawats, as it can lower their confidence."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "preschooler-screen-time",
        "title": "How Much Screen Time is Too Much for Preschoolers",
        "tag": "Preschoolers (3-5 Years)",
        "lead": "Balancing Technology and Play",
        "image_path": "./images/How Much Screen Time is Too Much for Preschoolers.jpeg",
        "pdf_path": "./pdfs/preschoolers/How Much Screen Time is Too Much for Preschoolers.pdf",
        "content_sections": [
            {
                "header": "Why Screen Time Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Screens can teach numbers or English, but overuse can delay language, reduce playtime, and cause tantrums. Balance is key."
                    }
                ]
            },
            {
                "header": "Recommended Limits",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Age 3–5: 1 hour max daily of high-quality content (educational shows, interactive apps).",
                            "Under 2: Avoid screens except video calls with Nana.",
                            "All ages: No screens 1–2 hours before bed to protect sleep."
                        ]
                    }
                ]
            },
            {
                "header": "Choosing Quality Content",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Educational: Pick shows like Sesame Street, Dora the Explorer, or Urdu apps teaching Alif-Bay.",
                            "Interactive: Apps where kids tap or answer are better than passive videos.",
                            "Desi picks: Watch Motu Patlu or Qari for Islamic rhymes, but limit to 20–30 minutes.",
                            "Co-watch: Sit together and talk about the show: “Why is Dora helping the monkey?”"
                        ]
                    }
                ]
            },
            {
                "header": "Setting Boundaries",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Make a schedule: Allow screens after lunch or before bath, not on demand.",
                            "Use timers: Say, “When the bell rings, TV’s off.” It reduces fights.",
                            "Create screen-free zones: No screens at meals or in bedrooms.",
                            "Offer alternatives: Swap screens for puzzles, coloring, or outdoor “Oonch Neech.”",
                            "Model limits: Put your phone down during family time to set an example."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Agree with Dadi or Baji on screen rules to avoid mixed signals.",
                            "Power cuts: Use outages as a chance for storytelling or board games.",
                            "Cultural shows: Balance desi cartoons with real-world play to teach tehzeeb.",
                            "Family gatherings: Limit screen use during dawats to encourage social interaction."
                        ]
                    }
                ]
            },
            {
                "header": "Signs of Too Much Screen Time",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Irritability: Tantrums or crankiness after screen use, especially if interrupted.",
                            "Sleep issues: Trouble falling asleep or frequent night waking.",
                            "Less play: Prefers screens over toys, puzzles, or outdoor games like pithoo.",
                            "Delayed speech: Limited vocabulary or reluctance to talk during family time."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "preschooler-starting-preschool",
        "title": "Starting Preschool",
        "tag": "Preschoolers (3-5 Years)",
        "lead": "Tips for a Smooth Transition",
        "image_path": "./images/Starting Preschool.jpeg",
        "pdf_path": "./pdfs/preschoolers/Starting Preschool.pdf",
        "content_sections": [
            {
                "header": "Why Preschool Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Preschool builds social skills, independence, and early learning foundations like letters and numbers. It’s also a chance for kids to explore beyond the home."
                    }
                ]
            },
            {
                "header": "Tips for a Smooth Start",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Talk it up: Describe preschool as a fun place with toys, friends, and stories. Say, “You’ll paint and sing like at home!”",
                            "Visit beforehand: If possible, tour the school together. Meet the teacher and explore the classroom to ease fears.",
                            "Practice routines: Set a similar wake-up, snack, and nap schedule at home a few weeks before. Teach them to use a backpack or lunchbox.",
                            "Read about it: Books like The Kissing Hand or Urdu stories about school can spark excitement.",
                            "Start small: If the school allows, begin with shorter days (2–3 hours) and gradually increase.",
                            "Say goodbye confidently: Keep drop-offs short and cheerful: “I’ll be back after story time!” Avoid sneaking away—it builds mistrust.",
                            "Pack comfort: Include a favorite toy or family photo in their bag for reassurance."
                        ]
                    }
                ]
            },
            {
                "header": "Handling Separation Anxiety",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Yours: It’s normal to feel teary! Chat with other parents or sip chai to distract yourself.",
                            "Theirs: If they cry, reassure them you’ll return. Teachers are pros at calming kids. Most settle within minutes.",
                            "Desi tip: A small dua like “Allah hafiz” with a hug can comfort both of you."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Prep grandparents or aunties to avoid over-coddling at pickup; consistency helps.",
                            "School choice: Whether it’s a local Montessori or a community madrassa, ensure it feels safe and welcoming.",
                            "Uniforms: Practice wearing the shalwar kameez or frock to avoid fuss.",
                            "Cultural prep: Teach basic Urdu or English phrases like “Assalamualaikum” for classroom greetings."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "preschooler-art-emotions",
        "title": "Helping Kids Express Emotions Through Art",
        "tag": "Preschoolers (3-5 Years)",
        "lead": "A Creative Outlet",
        "image_path": "./images/Helping Kids Express Emotions Through Art.jpeg",
        "pdf_path": "./pdfs/preschoolers/Helping Kids Express Emotions Through Art.pdf",
        "content_sections": [
            {
                "header": "Why Art Helps Emotions",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Drawing, painting, or crafting helps preschoolers express joy, anger, or fear. It also boosts confidence and calms tantrums."
                    }
                ]
            },
            {
                "header": "Art Activities for Emotional Expression",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Feeling Faces",
                                "items": [
                                    "What: Draw faces (happy, sad, mad) on paper plates. Ask, “Which face feels like you today?”",
                                    "Why: Teaches emotion names.",
                                    "Desi twist: Use Urdu words like “Khush” or “Naraz.”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Color Moods",
                                "items": [
                                    "What: Give crayons and ask, “What color is happy?” Let them scribble freely.",
                                    "Why: Links colors to feelings.",
                                    "Tip: Play soft desi rhymes like “Chanda Mama” to set the mood."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Story Painting",
                                "items": [
                                    "What: Ask them to paint a story (e.g., “What happened at the park?”). Talk about the picture.",
                                    "Why: Sparks emotional storytelling.",
                                    "Hack: Use watercolors or homemade paints (flour + food color)."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Clay Play",
                                "items": [
                                    "What: Mold clay into shapes when they’re upset. Say, “Squish the angry feeling out!”",
                                    "Why: Relieves stress through touch.",
                                    "Desi idea: Use atta dough for budget-friendly fun."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Collage Feelings",
                                "items": [
                                    "What: Glue magazine cutouts or fabric scraps to show “happy” or “scared.”",
                                    "Why: Encourages creativity and discussion.",
                                    "Tip: Use old dupatta scraps for texture."
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "How to Support Them",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Ask open questions: “Tell me about your picture!” Don’t judge their art.",
                            "Praise effort: Say, “I love how you used laal for happy!” to build confidence.",
                            "Create a space: Set up a corner with paper, crayons, and a mat for mess."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Parenting Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint family involvement: Encourage grandparents to join art sessions, sharing stories while kids draw.",
                            "Cultural crafts: Use mehndi designs or rangoli patterns to teach emotions through traditional art.",
                            "Budget hacks: Reuse household items like old fabric or jars for paint containers to keep costs low.",
                            "Festive art: During Eid, let kids create cards or decorations to express joy and connect with family."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "preschooler-nutrition",
        "title": "Nutrition Hacks for Active Preschoolers",
        "tag": "Preschoolers (3-5 Years)",
        "lead": "Fueling Growth",
        "image_path": "./images/Nutrition Hacks for Active Preschoolers.jpeg",
        "pdf_path": "./pdfs/preschoolers/Nutrition Hacks for Active Preschoolers.pdf",
        "content_sections": [
            {
                "header": "Why Nutrition Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Good food supports growth, immunity, and brain development. Preschoolers need balanced meals but often get picky or distracted."
                    }
                ]
            },
            {
                "header": "Nutrition Hacks",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Small, frequent meals: Offer 3 meals and 2–3 snacks daily. Small portions (1/2 roti, 1/4 cup daal) suit tiny tummies.",
                            {
                                "type": "sublist",
                                "title": "Hide the good stuff",
                                "items": [
                                    "Blend spinach into qeema or carrots into pulao.",
                                    "Mix fruit into yogurt for “lassi.”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Make it fun",
                                "items": [
                                    "Cut paratha into stars or arrange veggies as a face.",
                                    "Call broccoli “dino trees” or daal “super soup.”"
                                ]
                            },
                            "Involve them: Let them pick a fruit at the market or stir batter for halwa. They’ll eat what they “cook.”",
                            {
                                "type": "sublist",
                                "title": "Limit sugar",
                                "items": [
                                    "Swap mithai for fruit chaat with a drizzle of honey.",
                                    "Dilute juices with water or offer milk instead."
                                ]
                            },
                            "Protein power: Include eggs, chicken, or chickpeas daily for muscle growth. Try anda paratha or chana chaat.",
                            "Colorful plates: Offer a rainbow of foods (red apples, green peas) to cover vitamins."
                        ]
                    }
                ]
            },
            {
                "header": "Sample Pakistani Menu",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Breakfast: Suji ka halwa with milk or anda bhurji with roti.",
                            "Snack: Banana slices or roasted makhana.",
                            "Lunch: Chicken qeema with 1/2 roti, cucumber sticks.",
                            "Snack: Yogurt with a sprinkle of nuts (if no allergies).",
                            "Dinner: Daal-chawal with mashed palak."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Parenting Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Coordinate with Dadi to limit extra rusks or toffees.",
                            "Seasonal foods: Use fresh mangoes in summer or saag in winter for variety and nutrition.",
                            "Budget hacks: Opt for affordable staples like lentils or boiled eggs for protein-packed meals.",
                            "Cultural feasts: Allow small treats like sheer khurma during Eid, but balance with veggies."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "preschooler-social-skills",
        "title": "Social Skills",
        "tag": "Preschoolers (3-5 Years)",
        "lead": "Helping Preschoolers Make Friends",
        "image_path": "./images/Social Skills.jpeg",
        "pdf_path": "./pdfs/preschoolers/Social Skills.pdf",
        "content_sections": [
            {
                "header": "Why Social Skills Matter",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Social skills like sharing, listening, and cooperating help kids form friendships, resolve conflicts, and feel confident in groups."
                    }
                ]
            },
            {
                "header": "Ways to Build Social Skills",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Model kindness: Greet neighbors with “Assalamualaikum” or share snacks at dawats. Kids copy what you do.",
                            {
                                "type": "sublist",
                                "title": "Practice sharing",
                                "items": [
                                    "At home, take turns with a toy: “You roll the ball, then Ammi.”",
                                    "Praise them: “Great job sharing your car!”"
                                ]
                            },
                            "Teach greetings: Role-play saying “Hi, I’m Ali!” or “Adaab” to elders. Practice eye contact and smiles.",
                            "Arrange playdates: Invite a cousin or neighbor over. Start with short, supervised play (1 hour) to ease them in.",
                            "Read about friendship: Books like The Rainbow Fish or Urdu stories teach kindness. Ask, “How did the fish make friends?”",
                            {
                                "type": "sublist",
                                "title": "Role-play conflicts",
                                "items": [
                                    "Act out scenarios: “What if someone takes your crayon?”",
                                    "Guide them to say, “Please give it back” or get a teacher."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Encourage teamwork",
                                "items": [
                                    "Play group games like “Ring Around the Rosie” or desi “Kith Kith.”",
                                    "Praise cooperation: “You all built a big tower together!”"
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Use family time to practice taking turns or helping younger cousins.",
                            "Cultural values: Teach respect for elders as a social skill: “Say shukriya to Chachi for the toffee.”",
                            "Shy kids: Desi gatherings can overwhelm. Prep them with phrases like “Can I play?” to join in.",
                            "Festive bonding: Use Eid or weddings to practice greetings and sharing with relatives."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Bossiness: If they demand toys, redirect: “Let’s ask nicely.”",
                            "Shyness: Encourage small steps like waving to a friend, building confidence over time.",
                            "Overstimulation: Large dawats may overwhelm; offer quiet breaks to reset.",
                            "Peer conflicts: Teach them to use words like “I don’t like that” instead of hitting or crying."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "preschooler-myths",
        "title": "Desi Parenting Myths Busted",
        "tag": "Preschoolers (3-5 Years)",
        "lead": "Truths for Preschoolers",
        "image_path": "./images/Desi Parenting Myths Busted.jpeg",
        "pdf_path": "./pdfs/preschoolers/Desi Parenting Myths Busted.pdf",
        "content_sections": [
            {
                "header": "Common Myths and Truths",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Myth: “Feed them ghee to make them strong!”",
                                "items": [
                                    "Truth: Ghee is fine in moderation (1 tsp daily), but too much can lead to obesity. Kids need balanced diets with veggies, daal, and fruits for strength."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Myth: “Scare them to behave, like ‘Baba aayega!’”",
                                "items": [
                                    "Truth: Fear tactics cause anxiety and nightmares. Use positive discipline: “Let’s tidy toys to keep our room happy!”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Myth: “Boys don’t cry, and girls are shy.”",
                                "items": [
                                    "Truth: All kids have big emotions. Let boys cry and girls be bold—it builds emotional intelligence for life."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Myth: “More milk makes them tall.”",
                                "items": [
                                    "Truth: 400–500 ml milk daily is enough. Overloading reduces appetite for solids, which provide key nutrients like iron."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Myth: “Wrap them in layers to prevent colds.”",
                                "items": [
                                    "Truth: Over-bundling causes overheating, especially in Pakistan’s heat. Dress them like you (light shalwar kameez) and check for sweat."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Myth: “TV teaches English fast.”",
                                "items": [
                                    "Truth: Screens don’t boost language like talking or reading does. Limit to 1 hour daily and chat with them in English or Urdu instead."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Myth: “Desi remedies cure everything.”",
                                "items": [
                                    "Truth: Haldi milk soothes colds, but fevers, rashes, or diarrhea need a doctor. Delaying care can worsen things."
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "Why Myths Persist",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Elders share totkas with love, but they’re often outdated.",
                            "Cultural pride: Desi wisdom feels comforting, but science evolves.",
                            "Access issues: Some avoid doctors due to cost, relying on home remedies."
                        ]
                    }
                ]
            },
            {
                "header": "How to Handle Myths",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Respect elders: Say, “Dadi, I love your advice, but the doctor says this works better.”",
                            "Educate gently: Share articles or pediatrician tips with family.",
                            "Trust science: For vaccines, fevers, or growth, follow medical advice over totkas.",
                            "Blend traditions: Use safe remedies like haldi milk alongside doctor’s advice for minor issues."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "preschooler-learning-games",
        "title": "Easy Learning Games for Home Education",
        "tag": "Preschoolers (3-5 Years)",
        "lead": "Fun for Preschoolers",
        "image_path": "./images/Easy Learning Games for Home Education.jpeg",
        "pdf_path": "./pdfs/preschoolers/Easy Learning Games for Home Education.pdf",
        "content_sections": [
            {
                "header": "Why Learning Games Work",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Play builds early math, language, and problem-solving skills. It also keeps kids curious, prepping them for school."
                    }
                ]
            },
            {
                "header": "Fun Learning Games",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Color Hunt",
                                "items": [
                                    "What: Call out a color (e.g., “Find something red!”). They run to touch a red item.",
                                    "Skills: Color recognition, listening.",
                                    "Desi twist: Use Urdu names like “Laal” or “Neela.”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Number Jump",
                                "items": [
                                    "What: Write numbers 1–5 on paper squares, tape them to the floor. Say, “Jump to 3!” or count as they hop.",
                                    "Skills: Number recognition, motor skills.",
                                    "Tip: Play to desi rhymes for rhythm."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Letter Match",
                                "items": [
                                    "What: Write Urdu or English letters on cards and objects (e.g., “Alif” on an apple). They match them.",
                                    "Skills: Alphabet learning, vocabulary.",
                                    "Hack: Use old magazines for DIY cards."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Shape Sorting",
                                "items": [
                                    "What: Cut shapes (circle, square) from cardboard. Have them sort into piles or match to household items (e.g., plate = circle).",
                                    "Skills: Shape recognition, logic.",
                                    "Desi idea: Call shapes “Gola” or “Chokor.”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Story Chain",
                                "items": [
                                    "What: Start a story (“Once a cat went to…”) and let them add a sentence. Go back and forth.",
                                    "Skills: Language, creativity.",
                                    "Tip: Use desi tales like “Jungle ka Raja” for inspiration."
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "Tips for Success",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Keep it short: 10–15 minutes max; preschoolers lose focus fast.",
                            "Vary activities: Rotate between active games (like Number Jump) and quiet ones (like Letter Match) to maintain interest.",
                            "Use household items: Old boxes, bottles, or fabric scraps work as well as store-bought toys.",
                            "Involve family: Let siblings or Chachu join in, turning games into bonding moments."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "preschooler-safety",
        "title": "Safety Basics Every 4-Year-Old Should Know",
        "tag": "Preschoolers (3-5 Years)",
        "lead": "Empowering Kids with Safety Skills",
        "image_path": "./images/Safety Basics Every 4-Year-Old Should Know.jpeg",
        "pdf_path": "./pdfs/preschoolers/Safety Basics Every 4-Year-Old Should Know.pdf",
        "content_sections": [
            {
                "header": "Why Safety Skills Matter",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Preschoolers are curious but unaware of dangers like traffic or strangers. Simple rules build confidence and protect them."
                    }
                ]
            },
            {
                "header": "Key Safety Basics",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Know Their Info",
                                "items": [
                                    "Teach their full name, your name, and phone number (sing it to a rhyme for memory).",
                                    "Practice: “If you’re lost, tell a teacher, ‘My Ammi is Sana, call her!’”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Stranger Safety",
                                "items": [
                                    "Explain: “Don’t go with someone you don’t know, even if they offer toffee.”",
                                    "Teach: Run to a trusted adult (teacher, Dadi) if scared.",
                                    "Desi tip: Avoid fear-mongering like “Baba le jayega.”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Road Safety",
                                "items": [
                                    "Teach: “Hold Ammi’s hand near roads. Look left, right, left before crossing.”",
                                    "Practice at quiet streets or courtyards.",
                                    "Rule: Never chase a ball onto the road."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Fire Safety",
                                "items": [
                                    "Say: “If you see fire, don’t touch. Tell an adult fast.”",
                                    "Teach: Crawl low under smoke and go outside.",
                                    "Desi context: Explain stove dangers during chai time."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Safe Touch",
                                "items": [
                                    "Teach: “Your body is yours. No one should touch private parts except Ammi or doctor to keep you healthy.”",
                                    "Say: “Tell me if someone makes you uncomfortable.”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Emergency Calls",
                                "items": [
                                    "Show them to dial 15 (police) or 1122 (ambulance) on a phone if you’re hurt.",
                                    "Practice with a toy phone: “Say, ‘Help, my Abbu fell!’”"
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "How to Teach",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Keep it simple: Use short rules like “Stop, look, hold hand.”",
                            "Role-play: Act out “lost at market” or “stranger at park” scenarios.",
                            "Repeat often: Quiz them weekly: “What’s Ammi’s number?”",
                            "Praise efforts: Cheer, “You remembered to hold my hand!” to build confidence.",
                            "Use stories: Share tales like “The Brave Kid Who Said No” to reinforce lessons."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Parenting Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Teach all caregivers the same safety rules to ensure consistency.",
                            "Urban safety: In busy cities, practice road safety in courtyards before venturing to streets.",
                            "Cultural context: Use familiar settings like bazaars or dawats for role-playing scenarios.",
                            "Community support: Engage neighbors or school staff to reinforce safety lessons."
                        ]
                    }
                ]
            }
        ]
    },

    {
        "id": "school-age-after-school",
        "title": "After-School Routines",
        "tag": "School-Age Kids (5-10 Years)",
        "lead": "Routines that Actually Work for School-Age Kids",
        "image_path": "./images/After-School Routines.jpeg",
        "pdf_path": "./pdfs/school age/After School Routines.pdf",
        "content_sections": [
            {
                "header": "Why Routines Matter",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Routines reduce chaos, help with homework, and ensure kids get rest and play. They also teach time management, key for school success."
                    }
                ]
            },
            {
                "header": "A Sample Routine",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "3:00 PM – Snack Time: Offer a healthy snack like fruit chaat, anda paratha, or yogurt to refuel. Avoid sugary biscuits to prevent crashes.",
                            "3:30 PM – Unwind: Let them play outside, draw, or chat about their day for 30 minutes. Ask, “What was fun at school?”",
                            "4:00 PM – Homework: Set a quiet spot with no TV. Break tasks into 20-minute chunks with short breaks.",
                            "5:00 PM – Free Play: Outdoor games like cricket or “Pithu Gol Garam” burn energy. Indoor options: puzzles or reading.",
                            "6:00 PM – Family Time: Eat dinner together or help with small chores (e.g., setting the table).",
                            "7:00 PM – Wind Down: Read a story, pray, or talk. No screens 1 hour before bed.",
                            "8:00 PM – Bedtime: Aim for 9–11 hours of sleep, depending on age."
                        ]
                    }
                ]
            },
            {
                "header": "Tips for Success",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Be consistent: Stick to the same order daily, but allow flexibility for dawats or tuition.",
                            "Involve them: Let kids choose a snack or play activity to feel in control.",
                            "Desi hack: Use a chalkboard for a visual schedule—kids love ticking tasks off.",
                            "Limit distractions: Keep phones away during homework. Model this yourself.",
                            "Praise effort: Say, “Great job finishing math!” to boost motivation."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Coordinate with Dadi or Chachu to avoid extra treats that disrupt the routine.",
                            "Tuition culture: If kids have after-school classes, adjust playtime earlier or later.",
                            "Power cuts: Keep a torch or solar lamp for homework during outages.",
                            "Festive adjustments: During Eid or weddings, shift bedtime later but keep snacks and homework consistent."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Resistance: Kids may skip homework for play; use timers to keep them focused.",
                            "Family interference: Grandparents may offer extra snacks; politely set boundaries.",
                            "Fatigue: If kids are too tired post-school, allow a short nap (20 minutes) before homework.",
                            "Over-scheduling: Balance tuition and play to avoid burnout; prioritize rest."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "school-age-diet",
        "title": "Balanced Diet for Growing School-Age Kids",
        "tag": "School-Age Kids (5-10 Years)",
        "lead": "Fueling Growth and Focus",
        "image_path": "./images/Balanced Diet for Growing School-Age Kids.jpeg",
        "pdf_path": "./pdfs/school age/Balanced Diet for Growing School.pdf",
        "content_sections": [
            {
                "header": "Why a Balanced Diet Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Good nutrition supports strong bones, sharp minds, and immunity. Kids need carbs, proteins, fats, and vitamins in the right mix to thrive."
                    }
                ]
            },
            {
                "header": "Building a Balanced Plate",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Carbs (40–50%): Roti, rice, or paratha for energy. Choose whole grains like brown rice sometimes.",
                            "Proteins (20–30%): Eggs, chicken, daal, or fish for growth. Aim for 1–2 servings daily.",
                            "Veggies (20%): Carrots, palak, or bhindi for vitamins. Sneak into qeema if they’re picky.",
                            "Fruits (10%): Mangoes, bananas, or apples for fiber and sweetness.",
                            "Dairy: Milk, yogurt, or paneer (400–500 ml daily) for calcium.",
                            "Healthy fats: Ghee, nuts, or olive oil in moderation for brain health."
                        ]
                    }
                ]
            },
            {
                "header": "Sample Pakistani Menu",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Breakfast: Anda paratha with milk or suji ka halwa.",
                            "Snack: Fruit chaat or roasted chana.",
                            "Lunch: Chicken qeema with roti, cucumber slices.",
                            "Snack: Yogurt with nuts (if no allergies) or a boiled egg.",
                            "Dinner: Daal-chawal with palak, apple slices."
                        ]
                    }
                ]
            },
            {
                "header": "Tips for Success",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Make it colorful: A rainbow plate (red tomatoes, green peas) ensures variety.",
                            "Involve them: Let them pick a veggie at the sabzi mandi or stir daal.",
                            "Limit sugar: Save mithai for special days; offer fruit for dessert.",
                            "Desi hack: Blend veggies into gravies or add fruit to yogurt for “lassi.”",
                            "Small portions: Serve kid-sized amounts (1/2 roti, 1/4 cup daal) to avoid waste."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Align with Dadi to limit extra rusks or toffees.",
                            "School tiffins: Pack roti rolls with qeema or veggie paratha for nutrition on the go.",
                            "Budget tip: Use seasonal fruits like guavas or chickpeas for cheap protein.",
                            "Festive balance: Allow small portions of biryani or sheer khurma during Eid, paired with veggies."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "school-age-extracurriculars",
        "title": "Extracurriculars",
        "tag": "School-Age Kids (5-10 Years)",
        "lead": "Choosing What’s Right for School-Age Kids",
        "image_path": "./images/Extracurriculars.jpeg",
        "pdf_path": "./pdfs/school age/Extracurriculars.pdf",
        "content_sections": [
            {
                "header": "Why Extracurriculars Matter",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Activities build confidence, teamwork, and creativity. They also give kids a break from studies and a chance to shine."
                    }
                ]
            },
            {
                "header": "Factors to Consider",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Interest: Ask, “Do you want to play cricket, paint, or learn Quran?” Follow their excitement, not your dreams.",
                            "Time: Limit to 1–2 activities weekly to avoid burnout. School and homework come first.",
                            "Budget: Choose affordable options like school sports or community art classes. Avoid costly academies if funds are tight.",
                            "Skills: Pick activities that match their strengths (e.g., active kids for sports, quiet kids for drawing).",
                            "Social fit: Group activities like football build teamwork; solo ones like piano suit shy kids."
                        ]
                    }
                ]
            },
            {
                "header": "Great Options in Pakistan",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Sports: Cricket, football, or karate teach fitness and discipline.",
                            "Arts: Drawing, calligraphy, or Urdu poetry classes spark creativity.",
                            "Islamic learning: Quran recitation or Islamic history for spiritual growth.",
                            "Music/Dance: Tabla or bhangra classes for cultural pride.",
                            "STEM: Robotics or coding clubs for tech-savvy kids (check local libraries or schools)."
                        ]
                    }
                ]
            },
            {
                "header": "How to Choose",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Try before committing: Many programs offer trial classes. Test cricket or art for a week.",
                            "Talk to them: Ask, “Did you like kicking the ball or painting more?” to gauge interest.",
                            "Balance schedule: Avoid evening classes if they clash with tuition or family time.",
                            "Desi tip: Use family talents—let Chachu teach cricket or Dadi share Quran stories."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Over-scheduling: Too many activities tire kids. Stick to 2–3 hours weekly.",
                            "Lack of interest: If they lose enthusiasm, discuss why and consider switching activities.",
                            "Family pressure: Elders may push for certain activities; politely prioritize the child’s happiness.",
                            "Access issues: In smaller towns, options may be limited; explore online classes or community programs."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "school-age-confidence",
        "title": "Boosting Confidence in Shy School-Age Kids",
        "tag": "School-Age Kids (5-10 Years)",
        "lead": "Helping Quiet Kids Shine",
        "image_path": "./images/Boosting Confidence in Shy School-Age Kids.jpeg",
        "pdf_path": "./pdfs/school age/Boosting Confidence in Shy School.pdf",
        "content_sections": [
            {
                "header": "Why Shyness Happens",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Shyness is normal—some kids are naturally reserved or feel overwhelmed in groups. It’s not a flaw, but building confidence helps them thrive."
                    }
                ]
            },
            {
                "header": "Ways to Boost Confidence",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Celebrate small wins: Praise efforts like answering a question or greeting Chachu: “Wow, you said adaab so nicely!”",
                            {
                                "type": "sublist",
                                "title": "Practice social skills",
                                "items": [
                                    "Role-play saying “Can I play?” or “Assalamualaikum” at home.",
                                    "Start with one-on-one playdates before group outings."
                                ]
                            },
                            "Encourage hobbies: Let them try drawing, cricket, or storytelling. Mastering a skill boosts self-esteem.",
                            "Listen actively: When they talk, give full attention: “Tell me more about your drawing!” It shows their voice matters.",
                            "Avoid labels: Skip saying “He’s shy” in front of them—it can stick. Say, “He’s thoughtful and takes his time.”",
                            "Set small challenges: Ask them to order food at a restaurant or ask a teacher a question. Prep them first: “What will you say?”",
                            "Model confidence: Greet neighbors warmly or share a story at a dawat. They’ll mimic your ease."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Use family time to practice speaking with cousins or elders in a safe space.",
                            "Cultural pressure: Ignore comments like “Kitna chup hai!” Explain your child needs time to warm up.",
                            "Desi activities: Enroll in Quran classes or local sports to build skills and friends.",
                            "Festive opportunities: Encourage small greetings like “Eid Mubarak” at gatherings to build confidence."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Pushiness: Don’t force them to perform at gatherings—it builds anxiety. Let them join at their pace.",
                            "School struggles: If they avoid class participation, talk to their teacher for gentle encouragement.",
                            "Comparison: Avoid comparing them to bolder siblings—it hurts self-esteem.",
                            "Social overload: Large dawats can overwhelm; offer quiet breaks to recharge."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "school-age-homework",
        "title": "Managing Homework Without Tantrums",
        "tag": "School-Age Kids (5-10 Years)",
        "lead": "Stress-Free Study Time",
        "image_path": "./images/Managing Homework Without Tantrums for School-Age Kids.jpeg",
        "pdf_path": "./pdfs/school age/Managing Homework Without Tantrums for School.pdf",
        "content_sections": [
            {
                "header": "Why Homework Struggles Happen",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Kids may feel overwhelmed, tired, or bored. Tantrums flare when they’re hungry or distracted by siblings or TV."
                    }
                ]
            },
            {
                "header": "Strategies to Avoid Tantrums",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Set a homework spot: Create a quiet corner with a table, chair, and supplies. No TV or toys nearby.",
                            "Time it right: Start 30–60 minutes after school, after a snack and short playtime to recharge.",
                            "Break it down: Split tasks into 15–20-minute chunks with 5-minute breaks for stretching or water.",
                            "Stay positive: Say, “Let’s tackle math first—you’re great at numbers!” instead of “Hurry up!”",
                            "Guide, don’t do: Help with tricky questions but let them solve it: “What do you think comes next?”",
                            "Use timers: Set a 20-minute timer to focus. Say, “Beat the clock, and we’ll play afterward!”",
                            "Reward effort: Offer praise (“You worked so hard!”) or a small treat like a sticker or 10 extra minutes of play."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Parenting Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Ask Baji or Dada to keep younger siblings busy during homework time.",
                            "Desi motivation: Promise a family story session or a treat like gol gappay for finishing.",
                            "Tuition balance: If kids attend evening classes, limit homework to 30 minutes at home to avoid burnout.",
                            "Cultural focus: Emphasize education as “tehzeeb” to motivate kids to take homework seriously."
                        ]
                    }
                ]
            },
            {
                "header": "Handling Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Frustration: If they’re stuck, say, “Let’s read the question again together.” Take a break if tears start.",
                            "Procrastination: Use a visual checklist to track progress. Tick marks feel satisfying!",
                            "Distractions: Keep phones away—yours too. Model focus.",
                            "Perfectionism: If they obsess over neatness, praise effort over perfect handwriting."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "school-age-cyber-safety",
        "title": "Cyber Safety",
        "tag": "School-Age Kids (5-10 Years)",
        "lead": "Teaching Internet Rules for School-Age Kids",
        "image_path": "./images/Cyber Safety.jpeg",
        "pdf_path": "./pdfs/school age/Cyber Safety.pdf",
        "content_sections": [
            {
                "header": "Why Cyber Safety Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Kids can stumble on harmful content, share personal info, or face cyberbullying. Clear rules protect them while they explore."
                    }
                ]
            },
            {
                "header": "Key Internet Rules",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Never Share Personal Info",
                                "items": [
                                    "Teach: “Don’t tell anyone online your name, address, or school.”",
                                    "Practice: “If a game asks for your phone number, say no and tell Ammi.”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Stick to Safe Sites",
                                "items": [
                                    "Say: “Only use websites or apps we approve, like Khan Academy Kids or Islamic rhyme apps.”",
                                    "Set parental controls on browsers or YouTube Kids."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "No Talking to Strangers",
                                "items": [
                                    "Explain: “If someone messages you, don’t reply. Show me.”",
                                    "Compare to real life: “It’s like not talking to a stranger at the bazaar.”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Be Kind Online",
                                "items": [
                                    "Teach: “Don’t say mean things in games or chats. Treat others like you want to be treated.”",
                                    "Discuss: “How would you feel if someone teased you online?”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Limit Screen Time",
                                "items": [
                                    "Rule: 1–2 hours daily max, no screens before bed.",
                                    "Say: “After 30 minutes of games, let’s play cricket outside.”"
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "How to Teach",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Use stories: Share a tale of a kid who stayed safe by not sharing their name online.",
                            "Role-play: Pretend to be a “stranger” in a game and practice saying, “I don’t talk to you.”",
                            "Set up together: Show them how to use safe apps and explain why you block certain sites.",
                            "Praise smart choices: “Great job telling me about that pop-up ad!”",
                            "Desi hack: Compare online safety to locking the gate at home."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Agree with elders on internet rules to ensure consistency across devices.",
                            "Shared devices: Teach kids to log out of accounts to protect privacy, especially on Chachu’s tablet.",
                            "School projects: Guide them to use safe sites like BBC Bitesize for research, avoiding random links.",
                            "Cultural balance: Encourage offline activities like storytelling at dawats to reduce screen reliance."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "school-age-bullying",
        "title": "How to Spot and Handle Bullying",
        "tag": "School-Age Kids (5-10 Years)",
        "lead": "Supporting School-Age Kids",
        "image_path": "./images/How to Spot and Handle Bullying for School-Age Kids.jpeg",
        "pdf_path": "./pdfs/school age/How to Spot and Handle Bullying for School.pdf",
        "content_sections": [
            {
                "header": "What is Bullying?",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Bullying is repeated, intentional harm—physical (hitting), verbal (teasing), or social (excluding). It’s not a one-off fight but a pattern that makes kids feel powerless."
                    }
                ]
            },
            {
                "header": "Signs of Bullying",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Physical: Unexplained bruises, torn clothes, or missing items.",
                            "Emotional: Sudden fear of school, moodiness, or not wanting to play with friends.",
                            "Behavioral: Avoiding certain places (like the school bus) or losing interest in studies.",
                            "Physical complaints: Frequent headaches or stomachaches, especially before school."
                        ]
                    }
                ]
            },
            {
                "header": "How to Handle Bullying",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Listen calmly: If they share, say, “I’m glad you told me. Let’s fix this.” Don’t blame them.",
                            {
                                "type": "sublist",
                                "title": "Teach responses",
                                "items": [
                                    "Say, “Stop it” firmly or walk away.",
                                    "Tell a teacher or trusted adult: “Sir, he’s teasing me.”",
                                    "Practice at home to build confidence."
                                ]
                            },
                            "Talk to the school: Meet the teacher or principal. Ask about their anti-bullying policy. Be polite but firm.",
                            "Build their confidence: Praise strengths: “You’re so kind to your cousin!” Enroll in sports or art to boost self-esteem.",
                            "Monitor online: Check for cyberbullying in games or WhatsApp groups. Teach: “Don’t reply to mean messages—show me.”",
                            "Desi tip: Share stories like Bilal (RA)’s bravery to inspire standing up kindly."
                        ]
                    }
                ]
            },
            {
                "header": "Preventing Bullying",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Teach kindness: Model saying “shukriya” or sharing at dawats.",
                            "Role-play: Practice saying “That’s not nice” for teasing scenarios.",
                            "Encourage friendships: Arrange playdates to build a supportive circle.",
                            "Check in daily: Ask, “What made you happy or sad at school?”"
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Encourage cousins to support each other against bullying at school or dawats.",
                            "Cultural pressures: Address teasing about accents or clothes by teaching kids to value their identity.",
                            "School dynamics: Work with teachers to monitor group activities like sports or assemblies.",
                            "Community support: Engage local elders or mosque leaders to promote kindness in kids’ groups."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "school-age-islamic-stories",
        "title": "Introducing Islamic Stories to Young Minds",
        "tag": "School-Age Kids (5-10 Years)",
        "lead": "Building Faith and Morals",
        "image_path": "./images/Introducing Islamic Stories to Young Minds.jpeg",
        "pdf_path": "./pdfs/school age/Introducing Islamic Stories to Young Minds.pdf",
        "content_sections": [
            {
                "header": "Why Islamic Stories Matter",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Stories of prophets, companions, and Islamic values teach kindness, honesty, and patience. They also strengthen cultural identity and spiritual growth."
                    }
                ]
            },
            {
                "header": "Great Stories to Share",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Prophet Yunus (AS) and the Whale",
                                "items": [
                                    "Lesson: Trust in Allah during tough times.",
                                    "Tell: How Yunus (AS) prayed inside the whale and was saved."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Prophet Musa (AS) and the Red Sea",
                                "items": [
                                    "Lesson: Courage and faith in Allah’s plan.",
                                    "Share: How Allah parted the sea to save Musa (AS)."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "The Sleepers of the Cave (Ashab-e-Kahf)",
                                "items": [
                                    "Lesson: Standing up for beliefs.",
                                    "Describe: Young men who slept for years under Allah’s protection."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Bilal (RA), the First Muezzin",
                                "items": [
                                    "Lesson: Strength through faith.",
                                    "Highlight: His bravery despite hardship."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "The Ant and Prophet Sulaiman (AS)",
                                "items": [
                                    "Lesson: Respect for all creatures.",
                                    "Share: How Sulaiman (AS) listened to a tiny ant."
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "How to Share Stories",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Keep it simple: Use short, vivid sentences: “The whale swallowed Yunus, but he prayed!”",
                            "Use visuals: Show illustrated books like My First Quran Storybook or draw scenes together.",
                            "Make it fun: Act out stories with props (a dupatta for Musa’s staff) or puppet shows.",
                            "Ask questions: “What would you do in the cave?” to spark thinking.",
                            "Link to life: Say, “Like Bilal (RA), be brave when things are hard.”",
                            "Desi touch: Tell stories in Urdu or regional languages for deeper connection."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Family time: Share stories during Maghrib prayers or Sunday mornings with cousins.",
                            "Cultural tie-in: Relate tales to Eid or Ramadan for real-world meaning.",
                            "Community learning: Encourage mosque or madrassa classes to reinforce stories.",
                            "Family bonding: Let Dadi or Nana share their favorite Islamic stories for generational connection."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "school-age-emergencies",
        "title": "Preparing School-Age Kids for Emergency Situations",
        "tag": "School-Age Kids (5-10 Years)",
        "lead": "Building Confidence in Crises",
        "image_path": "./images/Preparing School-Age Kids for Emergency Situations.jpeg",
        "pdf_path": "./pdfs/school age/Preparing School Age Kids for Emergency Situations.pdf",
        "content_sections": [
            {
                "header": "Why Emergency Prep Matters",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Kids who know what to do in a crisis feel empowered and less afraid. Simple skills can save lives in fires, accidents, or crowded bazaars."
                    }
                ]
            },
            {
                "header": "Key Skills to Teach",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Emergency Contacts",
                                "items": [
                                    "Teach them your full name, phone number, and address. Sing it to a rhyme for memory.",
                                    "Practice: “If you’re lost, tell a police uncle, ‘My Ammi is Sana, call her!’”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Calling for Help",
                                "items": [
                                    "Show how to dial 15 (police) or 1122 (ambulance) on a phone. Say, “Tell them, ‘My Abbu fell, we’re at home!’”",
                                    "Use a toy phone for practice."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Fire Safety",
                                "items": [
                                    "Teach: “If you see fire, don’t hide. Crawl low and go outside.”",
                                    "Practice a home escape plan: “Run to the gate if you hear the smoke alarm.”",
                                    "Desi tip: Warn about kitchen stoves during chai time."
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "Getting Lost",
                                "items": [
                                    "Say: “Stay where you are and tell a shopkeeper or guard, ‘I’m lost.’ Don’t go with strangers.”",
                                    "Practice phrases at home: “My name is Ali, call my Ammi.”"
                                ]
                            },
                            {
                                "type": "sublist",
                                "title": "First Aid Basics",
                                "items": [
                                    "Teach: “If someone’s hurt, get an adult fast. Don’t touch blood.”",
                                    "Show how to press a cloth on a cut to stop bleeding."
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "header": "How to Teach",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Keep it simple: Use short rules like “Stop, call, stay.”",
                            "Role-play: Act out “lost at market” or “fire at home” scenarios.",
                            "Repeat monthly: Quiz: “What’s our address?” or “What’s 1122 for?”",
                            "Use stories: Share tales of brave kids who called for help to inspire them.",
                            "Stay calm: Avoid scary details; focus on being “smart and safe.”"
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Teach all caregivers the same emergency rules for consistency.",
                            "Urban safety: Practice in busy areas like bazaars, starting with role-plays at home.",
                            "Power outages: Teach kids to use torches or solar lamps safely during blackouts.",
                            "Community support: Involve neighbors or school staff to reinforce emergency skills."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "school-age-boundaries",
        "title": "Setting Boundaries Without Yelling",
        "tag": "School-Age Kids (5-10 Years)",
        "lead": "Calm Discipline for School-Age Kids",
        "image_path": "./images/Setting Boundaries Without Yelling for School-Age Kids.jpeg",
        "pdf_path": "./pdfs/school age/Setting Boundaries Without Yelling for School.pdf",
        "content_sections": [
            {
                "header": "Why Boundaries Matter",
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Clear rules teach kids self-control, respect, and responsibility—key for school and family life. Calm enforcement builds trust."
                    }
                ]
            },
            {
                "header": "Effective Boundary-Setting Tips",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            {
                                "type": "sublist",
                                "title": "Set clear rules",
                                "items": [
                                    "Say: “No TV until homework’s done” or “Bedtime is 8 PM.”",
                                    "Keep rules simple and age-appropriate (3–5 rules max)."
                                ]
                            },
                            "Explain why: “We tidy toys so no one trips” helps them understand.",
                            "Use a calm voice: Kneel to their level and say, “Let’s put the tablet away now.” Avoid shouting—it escalates fights.",
                            "Offer choices: “Do you want to tidy books or toys first?” gives them control within limits.",
                            "Follow through: If they break a rule, use logical consequences: “No tablet for a day if you sneak it after bedtime.”",
                            "Praise good behavior: “I love how you shared with Baji!” reinforces rules.",
                            "Model respect: Say “shukriya” or “sorry” yourself to show how it’s done."
                        ]
                    }
                ]
            },
            {
                "header": "Pakistani Context",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Joint families: Align with elders on rules to avoid confusion (e.g., no sweets before dinner).",
                            "Cultural norms: Teach respect for elders as a boundary: “We say adaab to Nanu.”",
                            "Desi hack: Use a dua like “Allah give me patience” to stay calm during tantrums.",
                            "Festive discipline: Maintain rules during dawats, like limiting screen time, for consistency."
                        ]
                    }
                ]
            },
            {
                "header": "Challenges",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Testing limits: Kids may push back. Stay firm: “The rule is no TV now.”",
                            "Family pressure: If Dadi says, “Let him play,” explain rules are for consistency.",
                            "Big emotions: If they tantrum, wait for calm, then restate the boundary.",
                            "Sibling conflicts: Teach them to resolve disputes with words, not yelling, to reinforce boundaries."
                        ]
                    }
                ]
            },
            {
                "header": "When to Worry",
                "content": [
                    {
                        "type": "list",
                        "items": [
                            "Persistent defiance: If rules are consistently ignored, consult a teacher or counselor for underlying issues.",
                            "Extreme reactions: Tantrums with aggression or withdrawal may need professional support.",
                            "Family stress: If joint family dynamics disrupt boundaries, hold a family meeting to align expectations.",
                            "School struggles: If boundary issues spill into class behavior, work with teachers to reinforce rules."
                        ]
                    }
                ]
            }
        ]
    }
]
